Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x3c9 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 15 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x34b11): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x88b0b): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x8167f): C:/Users/Tomvo/STM32CubeIDE/workspace_1.16.1/EDF_My_Board/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 16 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 2 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0xfb96): unsigned int
 <1><38>: Abbrev Number: 2 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x5b9be): long long int

    <1a1>   DW_AT_name        : (indirect string, offset: 0x852f3): osPriorityHigh4
    <1a5>   DW_AT_const_value : 44
 <2><1a6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x3c7c): osPriorityHigh5
    <1ab>   DW_AT_const_value : 45
 <2><1ac>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1ad>   DW_AT_name        : (indirect string, offset: 0x8532f): osPriorityHigh6
    <1b1>   DW_AT_const_value : 46
 <2><1b2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b3>   DW_AT_name        : (indirect string, offset: 0x8533f): osPriorityHigh7
    <1b7>   DW_AT_const_value : 47
 <2><1b8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b9>   DW_AT_name        : (indirect string, offset: 0x9b55d): osPriorityRealtime
    <1bd>   DW_AT_const_value : 48
 <2><1be>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1bf>   DW_AT_name        : (indirect string, offset: 0x7dee1): osPriorityRealtime1
    <1c3>   DW_AT_const_value : 49
 <2><1c4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1c5>   DW_AT_name        : (indirect string, offset: 0x7def5): osPriorityRealtime2
    <1c9>   DW_AT_const_value : 50
 <2><1ca>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1cb>   DW_AT_name        : (indirect string, offset: 0x7df09): osPriorityRealtime3
    <1cf>   DW_AT_const_value : 51
 <2><1d0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1d1>   DW_AT_name        : (indirect string, offset: 0x7df1d): osPriorityRealtime4
    <1d5>   DW_AT_const_value : 52
 <2><1d6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1d7>   DW_AT_name        : (indirect string, offset: 0x7df31): osPriorityRealtime5
    <1db>   DW_AT_const_value : 53
 <2><1dc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x337cf): osPriorityRealtime6
    <1e1>   DW_AT_const_value : 54
 <2><1e2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1e3>   DW_AT_name        : (indirect string, offset: 0x7df5b): osPriorityRealtime7
    <1e7>   DW_AT_const_value : 55
 <2><1e8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x5a217): osPriorityISR
    <1ed>   DW_AT_const_value : 56
 <2><1ee>: Abbrev Number: 5 (DW_TAG_enumerator)
    <1ef>   DW_AT_name        : (indirect string, offset: 0xb1891): osPriorityError
    <1f3>   DW_AT_const_value : -1
 <2><1f4>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1f5>   DW_AT_name        : (indirect string, offset: 0xbeb1f): osPriorityReserved
    <1f9>   DW_AT_const_value : 2147483647
 <2><1f9>: Abbrev Number: 0
 <1><1fa>: Abbrev Number: 4 (DW_TAG_typedef)
    <1fb>   DW_AT_name        : (indirect string, offset: 0x423c7): osPriority_t
    <1ff>   DW_AT_decl_file   : 4
    <200>   DW_AT_decl_line   : 136
    <201>   DW_AT_decl_column : 3
    <202>   DW_AT_type        : <0xb2>
 <1><206>: Abbrev Number: 4 (DW_TAG_typedef)
    <207>   DW_AT_name        : (indirect string, offset: 0x6cfb5): osThreadFunc_t
    <20b>   DW_AT_decl_file   : 4
    <20c>   DW_AT_decl_line   : 139
    <20d>   DW_AT_decl_column : 16
    <20e>   DW_AT_type        : <0x8f>
 <1><212>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <213>   DW_AT_encoding    : 5	(signed)
    <213>   DW_AT_byte_size   : 4
    <213>   DW_AT_type        : <0x2a>
    <217>   DW_AT_decl_file   : 4
    <217>   DW_AT_decl_line   : 176
    <218>   DW_AT_decl_column : 14
    <218>   DW_AT_sibling     : <0x24c>
 <2><21c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <21d>   DW_AT_name        : (indirect string, offset: 0xb15c2): osOK
    <221>   DW_AT_const_value : 0
 <2><222>: Abbrev Number: 5 (DW_TAG_enumerator)
    <223>   DW_AT_name        : (indirect string, offset: 0x5cc5a): osError
    <227>   DW_AT_const_value : -1
 <2><228>: Abbrev Number: 5 (DW_TAG_enumerator)
    <229>   DW_AT_name        : (indirect string, offset: 0xb517a): osErrorTimeout
    <22d>   DW_AT_const_value : -2
 <2><22e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <22f>   DW_AT_name        : (indirect string, offset: 0x83526): osErrorResource
    <233>   DW_AT_const_value : -3
 <2><234>: Abbrev Number: 5 (DW_TAG_enumerator)
    <235>   DW_AT_name        : (indirect string, offset: 0x3433c): osErrorParameter
    <239>   DW_AT_const_value : -4
 <2><23a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <23b>   DW_AT_name        : (indirect string, offset: 0x226da): osErrorNoMemory
    <23f>   DW_AT_const_value : -5
 <2><240>: Abbrev Number: 5 (DW_TAG_enumerator)
    <241>   DW_AT_name        : (indirect string, offset: 0x362ed): osErrorISR
    <245>   DW_AT_const_value : -6
 <2><246>: Abbrev Number: 11 (DW_TAG_enumerator)
    <247>   DW_AT_name        : (indirect string, offset: 0x655e5): osStatusReserved
    <24b>   DW_AT_const_value : 2147483647
 <2><24b>: Abbrev Number: 0
 <1><24c>: Abbrev Number: 4 (DW_TAG_typedef)
    <24d>   DW_AT_name        : (indirect string, offset: 0x43e02): osStatus_t
    <251>   DW_AT_decl_file   : 4
    <252>   DW_AT_decl_line   : 185
    <253>   DW_AT_decl_column : 3
    <254>   DW_AT_type        : <0x212>
 <1><258>: Abbrev Number: 4 (DW_TAG_typedef)
    <259>   DW_AT_name        : (indirect string, offset: 0x47a40): osThreadId_t
    <25d>   DW_AT_decl_file   : 4
    <25e>   DW_AT_decl_line   : 189
    <25f>   DW_AT_decl_column : 15
    <260>   DW_AT_type        : <0x9f>
 <1><264>: Abbrev Number: 4 (DW_TAG_typedef)
    <265>   DW_AT_name        : (indirect string, offset: 0x86ed7): TZ_ModuleId_t
    <269>   DW_AT_decl_file   : 4
    <26a>   DW_AT_decl_line   : 213
    <26b>   DW_AT_decl_column : 18
    <26c>   DW_AT_type        : <0x83>
 <1><270>: Abbrev Number: 19 (DW_TAG_structure_type)
    <271>   DW_AT_byte_size   : 36
    <272>   DW_AT_decl_file   : 4
    <273>   DW_AT_decl_line   : 218
    <274>   DW_AT_decl_column : 9
    <275>   DW_AT_sibling     : <0x2e6>
 <2><279>: Abbrev Number: 3 (DW_TAG_member)
    <27a>   DW_AT_name        : (indirect string, offset: 0xb3b1c): name
    <27e>   DW_AT_decl_file   : 4
    <27e>   DW_AT_decl_line   : 219
    <27f>   DW_AT_decl_column : 33
    <280>   DW_AT_type        : <0xad>
    <284>   DW_AT_data_member_location: 0
 <2><285>: Abbrev Number: 3 (DW_TAG_member)
    <286>   DW_AT_name        : (indirect string, offset: 0x8333e): attr_bits
    <28a>   DW_AT_decl_file   : 4
    <28a>   DW_AT_decl_line   : 220
    <28b>   DW_AT_decl_column : 28
    <28c>   DW_AT_type        : <0x83>
    <290>   DW_AT_data_member_location: 4
 <2><291>: Abbrev Number: 3 (DW_TAG_member)
    <292>   DW_AT_name        : (indirect string, offset: 0x647d): cb_mem
    <296>   DW_AT_decl_file   : 4
    <296>   DW_AT_decl_line   : 221
    <297>   DW_AT_decl_column : 30
    <298>   DW_AT_type        : <0x9f>
    <29c>   DW_AT_data_member_location: 8
 <2><29d>: Abbrev Number: 3 (DW_TAG_member)
    <29e>   DW_AT_name        : (indirect string, offset: 0x3688b): cb_size
    <2a2>   DW_AT_decl_file   : 4
    <2a2>   DW_AT_decl_line   : 222
    <2a3>   DW_AT_decl_column : 30
    <2a4>   DW_AT_type        : <0x83>
    <2a8>   DW_AT_data_member_location: 12
 <2><2a9>: Abbrev Number: 3 (DW_TAG_member)
    <2aa>   DW_AT_name        : (indirect string, offset: 0xb6460): stack_mem
    <2ae>   DW_AT_decl_file   : 4
    <2ae>   DW_AT_decl_line   : 223
    <2af>   DW_AT_decl_column : 27
    <2b0>   DW_AT_type        : <0x9f>
    <2b4>   DW_AT_data_member_location: 16
 <2><2b5>: Abbrev Number: 3 (DW_TAG_member)
    <2b6>   DW_AT_name        : (indirect string, offset: 0x7dfa5): stack_size
    <2ba>   DW_AT_decl_file   : 4
    <2ba>   DW_AT_decl_line   : 224
    <2bb>   DW_AT_decl_column : 27
    <2bc>   DW_AT_type        : <0x83>
    <2c0>   DW_AT_data_member_location: 20
 <2><2c1>: Abbrev Number: 3 (DW_TAG_member)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x4f2ee): priority
    <2c6>   DW_AT_decl_file   : 4
    <2c6>   DW_AT_decl_line   : 225
    <2c7>   DW_AT_decl_column : 29
    <2c8>   DW_AT_type        : <0x1fa>
    <2cc>   DW_AT_data_member_location: 24
 <2><2cd>: Abbrev Number: 3 (DW_TAG_member)
    <2ce>   DW_AT_name        : (indirect string, offset: 0x55c71): tz_module
    <2d2>   DW_AT_decl_file   : 4
    <2d2>   DW_AT_decl_line   : 226
    <2d3>   DW_AT_decl_column : 28
    <2d4>   DW_AT_type        : <0x264>
    <2d8>   DW_AT_data_member_location: 28
 <2><2d9>: Abbrev Number: 3 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x567e2): reserved
    <2de>   DW_AT_decl_file   : 4
    <2de>   DW_AT_decl_line   : 227
    <2df>   DW_AT_decl_column : 29
    <2e0>   DW_AT_type        : <0x83>
    <2e4>   DW_AT_data_member_location: 32
 <2><2e5>: Abbrev Number: 0
 <1><2e6>: Abbrev Number: 4 (DW_TAG_typedef)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x1fb98): osThreadAttr_t
    <2eb>   DW_AT_decl_file   : 4
    <2ec>   DW_AT_decl_line   : 228
    <2ed>   DW_AT_decl_column : 3
    <2ee>   DW_AT_type        : <0x270>
 <1><2f2>: Abbrev Number: 9 (DW_TAG_const_type)
    <2f3>   DW_AT_type        : <0x2e6>
 <1><2f7>: Abbrev Number: 7 (DW_TAG_variable)
    <2f8>   DW_AT_name        : (indirect string, offset: 0x136ee): myTask01Handle
    <2fc>   DW_AT_decl_file   : 1
    <2fc>   DW_AT_decl_line   : 51
    <2fd>   DW_AT_decl_column : 14
    <2fe>   DW_AT_type        : <0x258>
    <302>   DW_AT_external    : 1
    <302>   DW_AT_location    : 5 byte block: 3 7c 0 0 20 	(DW_OP_addr: 2000007c)
 <1><308>: Abbrev Number: 7 (DW_TAG_variable)
    <309>   DW_AT_name        : (indirect string, offset: 0x8b4ef): myTask01_attributes
    <30d>   DW_AT_decl_file   : 1
    <30d>   DW_AT_decl_line   : 52
    <30e>   DW_AT_decl_column : 22
    <30f>   DW_AT_type        : <0x2f2>
    <313>   DW_AT_external    : 1
    <313>   DW_AT_location    : 5 byte block: 3 30 68 0 8 	(DW_OP_addr: 8006830)
 <1><319>: Abbrev Number: 7 (DW_TAG_variable)
    <31a>   DW_AT_name        : (indirect string, offset: 0x68dbf): myTask02Handle
    <31e>   DW_AT_decl_file   : 1
    <31e>   DW_AT_decl_line   : 58
    <31f>   DW_AT_decl_column : 14
    <320>   DW_AT_type        : <0x258>
    <324>   DW_AT_external    : 1
    <324>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><32a>: Abbrev Number: 7 (DW_TAG_variable)
    <32b>   DW_AT_name        : (indirect string, offset: 0xaee3f): myTask02_attributes
    <32f>   DW_AT_decl_file   : 1
    <32f>   DW_AT_decl_line   : 59
    <330>   DW_AT_decl_column : 22
    <331>   DW_AT_type        : <0x2f2>
    <335>   DW_AT_external    : 1
    <335>   DW_AT_location    : 5 byte block: 3 54 68 0 8 	(DW_OP_addr: 8006854)
 <1><33b>: Abbrev Number: 12 (DW_TAG_subprogram)
    <33c>   DW_AT_external    : 1
    <33c>   DW_AT_name        : (indirect string, offset: 0xb58c4): osDelay
    <340>   DW_AT_decl_file   : 4
    <340>   DW_AT_decl_line   : 459
    <342>   DW_AT_decl_column : 12
    <343>   DW_AT_prototyped  : 1
    <343>   DW_AT_type        : <0x24c>
    <347>   DW_AT_declaration : 1
    <347>   DW_AT_sibling     : <0x351>
 <2><34b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <34c>   DW_AT_type        : <0x83>
 <2><350>: Abbrev Number: 0
 <1><351>: Abbrev Number: 12 (DW_TAG_subprogram)
    <352>   DW_AT_external    : 1
    <352>   DW_AT_name        : (indirect string, offset: 0x6fc68): osThreadNew
    <356>   DW_AT_decl_file   : 4
    <356>   DW_AT_decl_line   : 349
    <358>   DW_AT_decl_column : 14
    <359>   DW_AT_prototyped  : 1
    <359>   DW_AT_type        : <0x258>
    <35d>   DW_AT_declaration : 1
    <35d>   DW_AT_sibling     : <0x371>
 <2><361>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <362>   DW_AT_type        : <0x206>
 <2><366>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <367>   DW_AT_type        : <0x9f>
 <2><36b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <36c>   DW_AT_type        : <0x371>
 <2><370>: Abbrev Number: 0
 <1><371>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <372>   DW_AT_byte_size   : 4
    <372>   DW_AT_type        : <0x2f2>
 <1><376>: Abbrev Number: 13 (DW_TAG_subprogram)
    <377>   DW_AT_external    : 1
    <377>   DW_AT_name        : (indirect string, offset: 0xa4cd0): StartTask02
    <37b>   DW_AT_decl_file   : 1
    <37b>   DW_AT_decl_line   : 143
    <37c>   DW_AT_decl_column : 6
    <37c>   DW_AT_prototyped  : 1
    <37c>   DW_AT_low_pc      : 0x8000230
    <380>   DW_AT_high_pc     : 0x10
    <384>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <386>   DW_AT_call_all_tail_calls: 1
    <386>   DW_AT_sibling     : <0x398>
 <2><38a>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <38b>   DW_AT_name        : (indirect string, offset: 0x2a1c4): argument
    <38f>   DW_AT_decl_file   : 1
    <38f>   DW_AT_decl_line   : 143
    <390>   DW_AT_decl_column : 24
    <390>   DW_AT_type        : <0x9f>
    <394>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><397>: Abbrev Number: 0
 <1><398>: Abbrev Number: 13 (DW_TAG_subprogram)
    <399>   DW_AT_external    : 1
    <399>   DW_AT_name        : (indirect string, offset: 0xa4cc4): StartTask01
    <39d>   DW_AT_decl_file   : 1
    <39d>   DW_AT_decl_line   : 125
    <39e>   DW_AT_decl_column : 6
    <39e>   DW_AT_prototyped  : 1
    <39e>   DW_AT_low_pc      : 0x8000220
    <3a2>   DW_AT_high_pc     : 0x10
    <3a6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3a8>   DW_AT_call_all_tail_calls: 1
    <3a8>   DW_AT_sibling     : <0x3ba>
 <2><3ac>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <3ad>   DW_AT_name        : (indirect string, offset: 0x2a1c4): argument
    <3b1>   DW_AT_decl_file   : 1
    <3b1>   DW_AT_decl_line   : 125
    <3b2>   DW_AT_decl_column : 24
    <3b2>   DW_AT_type        : <0x9f>
    <3b6>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><3b9>: Abbrev Number: 0
 <1><3ba>: Abbrev Number: 20 (DW_TAG_subprogram)
    <3bb>   DW_AT_external    : 1
    <3bb>   DW_AT_name        : (indirect string, offset: 0x4ae64): MX_FREERTOS_Init
    <3bf>   DW_AT_decl_file   : 1
    <3c0>   DW_AT_decl_line   : 80
    <3c1>   DW_AT_decl_column : 6
    <3c2>   DW_AT_prototyped  : 1
    <3c2>   DW_AT_low_pc      : 0x80001e0
    <3c6>   DW_AT_high_pc     : 0x40
    <3ca>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3cc>   DW_AT_call_all_tail_calls: 1
 <1><3cc>: Abbrev Number: 0
  Compilation Unit @ offset 0x3cd:
   Length:        0x189 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x130
   Pointer Size:  4
 <0><3d9>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <3da>   DW_AT_producer    : (indirect string, offset: 0x34b11): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <3de>   DW_AT_language    : 29	(C11)
    <3df>   DW_AT_name        : (indirect string, offset: 0xc8df4): ../Core/Src/gpio.c
    <3e3>   DW_AT_comp_dir    : (indirect string, offset: 0x8167f): C:/Users/Tomvo/STM32CubeIDE/workspace_1.16.1/EDF_My_Board/Debug
    <3e7>   DW_AT_ranges      : 0x2b
    <3eb>   DW_AT_low_pc      : 0
    <3ef>   DW_AT_stmt_list   : 0xa2f
    <3f3>   DW_AT_macros      : 0x1f80b
 <1><3f7>: Abbrev Number: 1 (DW_TAG_base_type)
    <3f8>   DW_AT_byte_size   : 1
    <3f9>   DW_AT_encoding    : 6	(signed char)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x64b48): signed char
 <1><3fe>: Abbrev Number: 1 (DW_TAG_base_type)
    <3ff>   DW_AT_byte_size   : 1
    <400>   DW_AT_encoding    : 8	(unsigned char)
    <401>   DW_AT_name        : (indirect string, offset: 0x91d55): unsigned char
 <1><405>: Abbrev Number: 1 (DW_TAG_base_type)
    <406>   DW_AT_byte_size   : 2
    <407>   DW_AT_encoding    : 5	(signed)
    <408>   DW_AT_name        : (indirect string, offset: 0x95ab6): short int
 <1><40c>: Abbrev Number: 1 (DW_TAG_base_type)
    <40d>   DW_AT_byte_size   : 2
    <40e>   DW_AT_encoding    : 7	(unsigned)
    <40f>   DW_AT_name        : (indirect string, offset: 0xc020e): short unsigned int
 <1><413>: Abbrev Number: 1 (DW_TAG_base_type)
    <414>   DW_AT_byte_size   : 4
    <415>   DW_AT_encoding    : 5	(signed)
    <416>   DW_AT_name        : (indirect string, offset: 0x106f7): long int
 <1><41a>: Abbrev Number: 4 (DW_TAG_typedef)
    <41b>   DW_AT_name        : (indirect string, offset: 0x7fdb3): __uint32_t
    <41f>   DW_AT_decl_file   : 2
    <420>   DW_AT_decl_line   : 79
    <421>   DW_AT_decl_column : 25
    <422>   DW_AT_type        : <0x426>
 <1><426>: Abbrev Number: 1 (DW_TAG_base_type)
    <427>   DW_AT_byte_size   : 4
    <428>   DW_AT_encoding    : 7	(unsigned)
    <429>   DW_AT_name        : (indirect string, offset: 0x4c9d3): long unsigned int
 <1><42d>: Abbrev Number: 1 (DW_TAG_base_type)
    <42e>   DW_AT_byte_size   : 8
    <42f>   DW_AT_encoding    : 5	(signed)
    <430>   DW_AT_name        : (indirect string, offset: 0x5b9be): long long int
 <1><434>: Abbrev Number: 1 (DW_TAG_base_type)
    <435>   DW_AT_byte_size   : 8
    <436>   DW_AT_encoding    : 7	(unsigned)
    <437>   DW_AT_name        : (indirect string, offset: 0x2902b): long long unsigned int
 <1><43b>: Abbrev Number: 7 (DW_TAG_base_type)
    <43c>   DW_AT_byte_size   : 4
    <43d>   DW_AT_encoding    : 5	(signed)
    <43e>   DW_AT_name        : int
 <1><442>: Abbrev Number: 1 (DW_TAG_base_type)
    <443>   DW_AT_byte_size   : 4
    <444>   DW_AT_encoding    : 7	(unsigned)
    <445>   DW_AT_name        : (indirect string, offset: 0xfb96): unsigned int
 <1><449>: Abbrev Number: 4 (DW_TAG_typedef)
    <44a>   DW_AT_name        : (indirect string, offset: 0x924c9): uint32_t
    <44e>   DW_AT_decl_file   : 3
    <44f>   DW_AT_decl_line   : 48
    <450>   DW_AT_decl_column : 20
    <451>   DW_AT_type        : <0x41a>
 <1><455>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <456>   DW_AT_type        : <0x449>
 <1><45a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <45b>   DW_AT_byte_size   : 52
    <45c>   DW_AT_decl_file   : 4
    <45d>   DW_AT_decl_line   : 568
    <45f>   DW_AT_decl_column : 9
    <460>   DW_AT_sibling     : <0x500>
 <2><464>: Abbrev Number: 3 (DW_TAG_member)
    <465>   DW_AT_name        : CR
    <468>   DW_AT_decl_file   : 4
    <468>   DW_AT_decl_line   : 570
    <46a>   DW_AT_decl_column : 17
    <46a>   DW_AT_type        : <0x455>
    <46e>   DW_AT_data_member_location: 0
 <2><46f>: Abbrev Number: 2 (DW_TAG_member)
    <470>   DW_AT_name        : (indirect string, offset: 0xc8e42): CFGR
    <474>   DW_AT_decl_file   : 4
    <474>   DW_AT_decl_line   : 571
    <476>   DW_AT_decl_column : 17
    <476>   DW_AT_type        : <0x455>
    <47a>   DW_AT_data_member_location: 4
 <2><47b>: Abbrev Number: 3 (DW_TAG_member)
    <47c>   DW_AT_name        : CIR
    <480>   DW_AT_decl_file   : 4
    <480>   DW_AT_decl_line   : 572
    <482>   DW_AT_decl_column : 17
    <482>   DW_AT_type        : <0x455>
    <486>   DW_AT_data_member_location: 8
 <2><487>: Abbrev Number: 2 (DW_TAG_member)
    <488>   DW_AT_name        : (indirect string, offset: 0xc8e1f): APB2RSTR
    <48c>   DW_AT_decl_file   : 4
    <48c>   DW_AT_decl_line   : 573
    <48e>   DW_AT_decl_column : 17
    <48e>   DW_AT_type        : <0x455>
    <492>   DW_AT_data_member_location: 12
 <2><493>: Abbrev Number: 2 (DW_TAG_member)
    <494>   DW_AT_name        : (indirect string, offset: 0xc8de3): APB1RSTR
    <498>   DW_AT_decl_file   : 4
    <498>   DW_AT_decl_line   : 574
    <49a>   DW_AT_decl_column : 17
    <49a>   DW_AT_type        : <0x455>
    <49e>   DW_AT_data_member_location: 16
 <2><49f>: Abbrev Number: 2 (DW_TAG_member)
    <4a0>   DW_AT_name        : (indirect string, offset: 0xc8e47): AHBENR
    <4a4>   DW_AT_decl_file   : 4
    <4a4>   DW_AT_decl_line   : 575
    <4a6>   DW_AT_decl_column : 17
    <4a6>   DW_AT_type        : <0x455>
    <4aa>   DW_AT_data_member_location: 20
 <2><4ab>: Abbrev Number: 2 (DW_TAG_member)
    <4ac>   DW_AT_name        : (indirect string, offset: 0xc8dec): APB2ENR
    <4b0>   DW_AT_decl_file   : 4
    <4b0>   DW_AT_decl_line   : 576
    <4b2>   DW_AT_decl_column : 17
    <4b2>   DW_AT_type        : <0x455>
    <4b6>   DW_AT_data_member_location: 24
 <2><4b7>: Abbrev Number: 2 (DW_TAG_member)
    <4b8>   DW_AT_name        : (indirect string, offset: 0xc8e34): APB1ENR
    <4bc>   DW_AT_decl_file   : 4
    <4bc>   DW_AT_decl_line   : 577
    <4be>   DW_AT_decl_column : 17
    <4be>   DW_AT_type        : <0x455>
    <4c2>   DW_AT_data_member_location: 28
 <2><4c3>: Abbrev Number: 2 (DW_TAG_member)
    <4c4>   DW_AT_name        : (indirect string, offset: 0xc8e07): BDCR
    <4c8>   DW_AT_decl_file   : 4
    <4c8>   DW_AT_decl_line   : 578
    <4ca>   DW_AT_decl_column : 17
    <4ca>   DW_AT_type        : <0x455>
    <4ce>   DW_AT_data_member_location: 32
 <2><4cf>: Abbrev Number: 3 (DW_TAG_member)
    <4d0>   DW_AT_name        : CSR
    <4d4>   DW_AT_decl_file   : 4
    <4d4>   DW_AT_decl_line   : 579
    <4d6>   DW_AT_decl_column : 17
    <4d6>   DW_AT_type        : <0x455>
    <4da>   DW_AT_data_member_location: 36
 <2><4db>: Abbrev Number: 2 (DW_TAG_member)
    <4dc>   DW_AT_name        : (indirect string, offset: 0xc8ddb): AHBRSTR
    <4e0>   DW_AT_decl_file   : 4
    <4e0>   DW_AT_decl_line   : 580
    <4e2>   DW_AT_decl_column : 17
    <4e2>   DW_AT_type        : <0x455>
    <4e6>   DW_AT_data_member_location: 40
 <2><4e7>: Abbrev Number: 2 (DW_TAG_member)
    <4e8>   DW_AT_name        : (indirect string, offset: 0xc8e3c): CFGR2
    <4ec>   DW_AT_decl_file   : 4
    <4ec>   DW_AT_decl_line   : 581
    <4ee>   DW_AT_decl_column : 17
    <4ee>   DW_AT_type        : <0x455>
    <4f2>   DW_AT_data_member_location: 44
 <2><4f3>: Abbrev Number: 2 (DW_TAG_member)
    <4f4>   DW_AT_name        : (indirect string, offset: 0xc8e19): CFGR3
    <4f8>   DW_AT_decl_file   : 4
    <4f8>   DW_AT_decl_line   : 582
    <4fa>   DW_AT_decl_column : 17
    <4fa>   DW_AT_type        : <0x455>
    <4fe>   DW_AT_data_member_location: 48
 <2><4ff>: Abbrev Number: 0
 <1><500>: Abbrev Number: 10 (DW_TAG_typedef)
    <501>   DW_AT_name        : (indirect string, offset: 0xc8e28): RCC_TypeDef
    <505>   DW_AT_decl_file   : 4
    <506>   DW_AT_decl_line   : 583
    <508>   DW_AT_decl_column : 3
    <509>   DW_AT_type        : <0x45a>
 <1><50d>: Abbrev Number: 1 (DW_TAG_base_type)
    <50e>   DW_AT_byte_size   : 8
    <50f>   DW_AT_encoding    : 4	(float)
    <510>   DW_AT_name        : (indirect string, offset: 0x11ed1): long double
 <1><514>: Abbrev Number: 11 (DW_TAG_subprogram)
    <515>   DW_AT_external    : 1
    <515>   DW_AT_name        : (indirect string, offset: 0xc8e0c): MX_GPIO_Init
    <519>   DW_AT_decl_file   : 1
    <51a>   DW_AT_decl_line   : 42
    <51b>   DW_AT_decl_column : 6
    <51c>   DW_AT_prototyped  : 1
    <51c>   DW_AT_low_pc      : 0x8000240
    <520>   DW_AT_high_pc     : 0x48
    <524>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <526>   DW_AT_call_all_calls: 1
 <2><526>: Abbrev Number: 12 (DW_TAG_lexical_block)
    <527>   DW_AT_low_pc      : 0x8000246
    <52b>   DW_AT_high_pc     : 0x18
    <52f>   DW_AT_sibling     : <0x541>
 <3><533>: Abbrev Number: 5 (DW_TAG_variable)
    <534>   DW_AT_name        : (indirect string, offset: 0xc8dd4): tmpreg
    <538>   DW_AT_decl_file   : 1
    <538>   DW_AT_decl_line   : 46
    <539>   DW_AT_decl_column : 3
    <539>   DW_AT_type        : <0x455>
    <53d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><540>: Abbrev Number: 0
 <2><541>: Abbrev Number: 13 (DW_TAG_lexical_block)
    <542>   DW_AT_low_pc      : 0x800025e
    <546>   DW_AT_high_pc     : 0x18
 <3><54a>: Abbrev Number: 5 (DW_TAG_variable)
    <54b>   DW_AT_name        : (indirect string, offset: 0xc8dd4): tmpreg
    <54f>   DW_AT_decl_file   : 1
    <54f>   DW_AT_decl_line   : 47
    <550>   DW_AT_decl_column : 3
    <550>   DW_AT_type        : <0x455>
    <554>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><557>: Abbrev Number: 0
 <2><558>: Abbrev Number: 0
 <1><559>: Abbrev Number: 0
  Compilation Unit @ offset 0x55a:
   Length:        0x110c (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1f6
   Pointer Size:  4
 <0><566>: Abbrev Number: 32 (DW_TAG_compile_unit)
    <567>   DW_AT_producer    : (indirect string, offset: 0x34b11): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <56b>   DW_AT_language    : 29	(C11)
    <56c>   DW_AT_name        : (indirect string, offset: 0xc9897): ../Core/Src/main.c
    <570>   DW_AT_comp_dir    : (indirect string, offset: 0x8167f): C:/Users/Tomvo/STM32CubeIDE/workspace_1.16.1/EDF_My_Board/Debug
    <574>   DW_AT_ranges      : 0x3e
    <578>   DW_AT_low_pc      : 0
    <57c>   DW_AT_stmt_list   : 0x119d
    <580>   DW_AT_macros      : 0x1f9f6
 <1><584>: Abbrev Number: 10 (DW_TAG_base_type)
    <585>   DW_AT_byte_size   : 1
    <586>   DW_AT_encoding    : 6	(signed char)
    <587>   DW_AT_name        : (indirect string, offset: 0x64b48): signed char
 <1><58b>: Abbrev Number: 5 (DW_TAG_typedef)
    <58c>   DW_AT_name        : (indirect string, offset: 0xc90e3): __uint8_t
    <590>   DW_AT_decl_file   : 4
    <591>   DW_AT_decl_line   : 43
    <592>   DW_AT_decl_column : 24
    <593>   DW_AT_type        : <0x597>
 <1><597>: Abbrev Number: 10 (DW_TAG_base_type)
    <598>   DW_AT_byte_size   : 1
    <599>   DW_AT_encoding    : 8	(unsigned char)
    <59a>   DW_AT_name        : (indirect string, offset: 0x91d55): unsigned char
 <1><59e>: Abbrev Number: 10 (DW_TAG_base_type)
    <59f>   DW_AT_byte_size   : 2
    <5a0>   DW_AT_encoding    : 5	(signed)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x95ab6): short int
 <1><5a5>: Abbrev Number: 5 (DW_TAG_typedef)
    <5a6>   DW_AT_name        : (indirect string, offset: 0xc9781): __uint16_t
    <5aa>   DW_AT_decl_file   : 4
    <5ab>   DW_AT_decl_line   : 57
    <5ac>   DW_AT_decl_column : 25
    <5ad>   DW_AT_type        : <0x5b1>
 <1><5b1>: Abbrev Number: 10 (DW_TAG_base_type)
    <5b2>   DW_AT_byte_size   : 2
    <5b3>   DW_AT_encoding    : 7	(unsigned)
    <5b4>   DW_AT_name        : (indirect string, offset: 0xc020e): short unsigned int
 <1><5b8>: Abbrev Number: 10 (DW_TAG_base_type)
    <5b9>   DW_AT_byte_size   : 4
    <5ba>   DW_AT_encoding    : 5	(signed)
    <5bb>   DW_AT_name        : (indirect string, offset: 0x106f7): long int
 <1><5bf>: Abbrev Number: 5 (DW_TAG_typedef)
    <5c0>   DW_AT_name        : (indirect string, offset: 0x7fdb3): __uint32_t
    <5c4>   DW_AT_decl_file   : 4
    <5c5>   DW_AT_decl_line   : 79
    <5c6>   DW_AT_decl_column : 25
    <5c7>   DW_AT_type        : <0x5cb>
 <1><5cb>: Abbrev Number: 10 (DW_TAG_base_type)
    <5cc>   DW_AT_byte_size   : 4
    <5cd>   DW_AT_encoding    : 7	(unsigned)
    <5ce>   DW_AT_name        : (indirect string, offset: 0x4c9d3): long unsigned int
 <1><5d2>: Abbrev Number: 10 (DW_TAG_base_type)
    <5d3>   DW_AT_byte_size   : 8
    <5d4>   DW_AT_encoding    : 5	(signed)
    <5d5>   DW_AT_name        : (indirect string, offset: 0x5b9be): long long int
 <1><5d9>: Abbrev Number: 10 (DW_TAG_base_type)
    <5da>   DW_AT_byte_size   : 8
    <5db>   DW_AT_encoding    : 7	(unsigned)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x2902b): long long unsigned int
 <1><5e0>: Abbrev Number: 33 (DW_TAG_base_type)
    <5e1>   DW_AT_byte_size   : 4
    <5e2>   DW_AT_encoding    : 5	(signed)
    <5e3>   DW_AT_name        : int
 <1><5e7>: Abbrev Number: 10 (DW_TAG_base_type)
    <5e8>   DW_AT_byte_size   : 4
    <5e9>   DW_AT_encoding    : 7	(unsigned)
    <5ea>   DW_AT_name        : (indirect string, offset: 0xfb96): unsigned int
 <1><5ee>: Abbrev Number: 5 (DW_TAG_typedef)
    <5ef>   DW_AT_name        : (indirect string, offset: 0xc90e5): uint8_t
    <5f3>   DW_AT_decl_file   : 5
    <5f4>   DW_AT_decl_line   : 24
    <5f5>   DW_AT_decl_column : 19
    <5f6>   DW_AT_type        : <0x58b>
 <1><5fa>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <5fb>   DW_AT_type        : <0x5ee>
 <1><5ff>: Abbrev Number: 27 (DW_TAG_const_type)
    <600>   DW_AT_type        : <0x5ee>
 <1><604>: Abbrev Number: 5 (DW_TAG_typedef)
    <605>   DW_AT_name        : (indirect string, offset: 0x92dc9): uint16_t
    <609>   DW_AT_decl_file   : 5
    <60a>   DW_AT_decl_line   : 36
    <60b>   DW_AT_decl_column : 20
    <60c>   DW_AT_type        : <0x5a5>
 <1><610>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <611>   DW_AT_type        : <0x604>
 <1><615>: Abbrev Number: 5 (DW_TAG_typedef)
    <616>   DW_AT_name        : (indirect string, offset: 0x924c9): uint32_t
    <61a>   DW_AT_decl_file   : 5
    <61b>   DW_AT_decl_line   : 48
    <61c>   DW_AT_decl_column : 20
    <61d>   DW_AT_type        : <0x5bf>
 <1><621>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <622>   DW_AT_type        : <0x615>
 <1><626>: Abbrev Number: 27 (DW_TAG_const_type)
    <627>   DW_AT_type        : <0x621>
 <1><62b>: Abbrev Number: 34 (DW_TAG_union_type)
    <62c>   DW_AT_byte_size   : 4
    <62d>   DW_AT_decl_file   : 2
    <62e>   DW_AT_decl_line   : 813
    <630>   DW_AT_decl_column : 9
    <631>   DW_AT_sibling     : <0x656>
 <2><635>: Abbrev Number: 22 (DW_TAG_member)
    <636>   DW_AT_name        : u8
    <639>   DW_AT_decl_file   : 2
    <639>   DW_AT_decl_line   : 815
    <63b>   DW_AT_decl_column : 22
    <63b>   DW_AT_type        : <0x5fa>
 <2><63f>: Abbrev Number: 22 (DW_TAG_member)
    <640>   DW_AT_name        : u16
    <644>   DW_AT_decl_file   : 2
    <644>   DW_AT_decl_line   : 816
    <646>   DW_AT_decl_column : 22
    <646>   DW_AT_type        : <0x610>
 <2><64a>: Abbrev Number: 22 (DW_TAG_member)
    <64b>   DW_AT_name        : u32
    <64f>   DW_AT_decl_file   : 2
    <64f>   DW_AT_decl_line   : 817
    <651>   DW_AT_decl_column : 22
    <651>   DW_AT_type        : <0x621>
 <2><655>: Abbrev Number: 0
 <1><656>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <657>   DW_AT_type        : <0x62b>
 <1><65b>: Abbrev Number: 35 (DW_TAG_structure_type)
    <65c>   DW_AT_byte_size   : 4096
    <65e>   DW_AT_decl_file   : 2
    <65f>   DW_AT_decl_line   : 811
    <661>   DW_AT_decl_column : 9
    <662>   DW_AT_sibling     : <0x7c8>
 <2><666>: Abbrev Number: 1 (DW_TAG_member)
    <667>   DW_AT_name        : (indirect string, offset: 0xc9307): PORT
    <66b>   DW_AT_decl_file   : 2
    <66c>   DW_AT_decl_line   : 818
    <66e>   DW_AT_decl_column : 6
    <66f>   DW_AT_type        : <0x7d8>
    <673>   DW_AT_data_member_location: 0
 <2><674>: Abbrev Number: 1 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0xc9920): RESERVED0
    <679>   DW_AT_decl_file   : 2
    <67a>   DW_AT_decl_line   : 819
    <67c>   DW_AT_decl_column : 18
    <67d>   DW_AT_type        : <0x7dd>
    <681>   DW_AT_data_member_location: 128
 <2><682>: Abbrev Number: 15 (DW_TAG_member)
    <683>   DW_AT_name        : TER
    <687>   DW_AT_decl_file   : 2
    <687>   DW_AT_decl_line   : 820
    <689>   DW_AT_decl_column : 18
    <689>   DW_AT_type        : <0x621>
    <68d>   DW_AT_data_member_location: 3584
 <2><68f>: Abbrev Number: 6 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0xc992a): RESERVED1
    <694>   DW_AT_decl_file   : 2
    <694>   DW_AT_decl_line   : 821
    <696>   DW_AT_decl_column : 18
    <696>   DW_AT_type        : <0x7ee>
    <69a>   DW_AT_data_member_location: 3588
 <2><69c>: Abbrev Number: 15 (DW_TAG_member)
    <69d>   DW_AT_name        : TPR
    <6a1>   DW_AT_decl_file   : 2
    <6a1>   DW_AT_decl_line   : 822
    <6a3>   DW_AT_decl_column : 18
    <6a3>   DW_AT_type        : <0x621>
    <6a7>   DW_AT_data_member_location: 3648
 <2><6a9>: Abbrev Number: 6 (DW_TAG_member)
    <6aa>   DW_AT_name        : (indirect string, offset: 0xc9934): RESERVED2
    <6ae>   DW_AT_decl_file   : 2
    <6ae>   DW_AT_decl_line   : 823
    <6b0>   DW_AT_decl_column : 18
    <6b0>   DW_AT_type        : <0x7ee>
    <6b4>   DW_AT_data_member_location: 3652
 <2><6b6>: Abbrev Number: 15 (DW_TAG_member)
    <6b7>   DW_AT_name        : TCR
    <6bb>   DW_AT_decl_file   : 2
    <6bb>   DW_AT_decl_line   : 824
    <6bd>   DW_AT_decl_column : 18
    <6bd>   DW_AT_type        : <0x621>
    <6c1>   DW_AT_data_member_location: 3712
 <2><6c3>: Abbrev Number: 6 (DW_TAG_member)
    <6c4>   DW_AT_name        : (indirect string, offset: 0xc993e): RESERVED3
    <6c8>   DW_AT_decl_file   : 2
    <6c8>   DW_AT_decl_line   : 825
    <6ca>   DW_AT_decl_column : 18
    <6ca>   DW_AT_type        : <0x7fe>
    <6ce>   DW_AT_data_member_location: 3716
 <2><6d0>: Abbrev Number: 15 (DW_TAG_member)
    <6d1>   DW_AT_name        : IWR
    <6d5>   DW_AT_decl_file   : 2
    <6d5>   DW_AT_decl_line   : 826
    <6d7>   DW_AT_decl_column : 18
    <6d7>   DW_AT_type        : <0x621>
    <6db>   DW_AT_data_member_location: 3832
 <2><6dd>: Abbrev Number: 15 (DW_TAG_member)
    <6de>   DW_AT_name        : IRR
    <6e2>   DW_AT_decl_file   : 2
    <6e2>   DW_AT_decl_line   : 827
    <6e4>   DW_AT_decl_column : 18
    <6e4>   DW_AT_type        : <0x626>
    <6e8>   DW_AT_data_member_location: 3836
 <2><6ea>: Abbrev Number: 6 (DW_TAG_member)
    <6eb>   DW_AT_name        : (indirect string, offset: 0xc94d7): IMCR
    <6ef>   DW_AT_decl_file   : 2
    <6ef>   DW_AT_decl_line   : 828
    <6f1>   DW_AT_decl_column : 18
    <6f1>   DW_AT_type        : <0x621>
    <6f5>   DW_AT_data_member_location: 3840
 <2><6f7>: Abbrev Number: 6 (DW_TAG_member)
    <6f8>   DW_AT_name        : (indirect string, offset: 0xc98d3): RESERVED4
    <6fc>   DW_AT_decl_file   : 2
    <6fc>   DW_AT_decl_line   : 829
    <6fe>   DW_AT_decl_column : 18
    <6fe>   DW_AT_type        : <0x80e>
    <702>   DW_AT_data_member_location: 3844
 <2><704>: Abbrev Number: 15 (DW_TAG_member)
    <705>   DW_AT_name        : LAR
    <709>   DW_AT_decl_file   : 2
    <709>   DW_AT_decl_line   : 830
    <70b>   DW_AT_decl_column : 18
    <70b>   DW_AT_type        : <0x621>
    <70f>   DW_AT_data_member_location: 4016
 <2><711>: Abbrev Number: 15 (DW_TAG_member)
    <712>   DW_AT_name        : LSR
    <716>   DW_AT_decl_file   : 2
    <716>   DW_AT_decl_line   : 831
    <718>   DW_AT_decl_column : 18
    <718>   DW_AT_type        : <0x626>
    <71c>   DW_AT_data_member_location: 4020
 <2><71e>: Abbrev Number: 6 (DW_TAG_member)
    <71f>   DW_AT_name        : (indirect string, offset: 0xc9948): RESERVED5
    <723>   DW_AT_decl_file   : 2
    <723>   DW_AT_decl_line   : 832
    <725>   DW_AT_decl_column : 18
    <725>   DW_AT_type        : <0x81e>
    <729>   DW_AT_data_member_location: 4024
 <2><72b>: Abbrev Number: 6 (DW_TAG_member)
    <72c>   DW_AT_name        : (indirect string, offset: 0xc9202): PID4
    <730>   DW_AT_decl_file   : 2
    <730>   DW_AT_decl_line   : 833
    <732>   DW_AT_decl_column : 18
    <732>   DW_AT_type        : <0x626>
    <736>   DW_AT_data_member_location: 4048
 <2><738>: Abbrev Number: 6 (DW_TAG_member)
    <739>   DW_AT_name        : (indirect string, offset: 0xc9207): PID5
    <73d>   DW_AT_decl_file   : 2
    <73d>   DW_AT_decl_line   : 834
    <73f>   DW_AT_decl_column : 18
    <73f>   DW_AT_type        : <0x626>
    <743>   DW_AT_data_member_location: 4052
 <2><745>: Abbrev Number: 6 (DW_TAG_member)
    <746>   DW_AT_name        : (indirect string, offset: 0xc920c): PID6
    <74a>   DW_AT_decl_file   : 2
    <74a>   DW_AT_decl_line   : 835
    <74c>   DW_AT_decl_column : 18
    <74c>   DW_AT_type        : <0x626>
    <750>   DW_AT_data_member_location: 4056
 <2><752>: Abbrev Number: 6 (DW_TAG_member)
    <753>   DW_AT_name        : (indirect string, offset: 0xc9211): PID7
    <757>   DW_AT_decl_file   : 2
    <757>   DW_AT_decl_line   : 836
    <759>   DW_AT_decl_column : 18
    <759>   DW_AT_type        : <0x626>
    <75d>   DW_AT_data_member_location: 4060
 <2><75f>: Abbrev Number: 6 (DW_TAG_member)
    <760>   DW_AT_name        : (indirect string, offset: 0xc91f8): PID0
    <764>   DW_AT_decl_file   : 2
    <764>   DW_AT_decl_line   : 837
    <766>   DW_AT_decl_column : 18
    <766>   DW_AT_type        : <0x626>
    <76a>   DW_AT_data_member_location: 4064
 <2><76c>: Abbrev Number: 6 (DW_TAG_member)
    <76d>   DW_AT_name        : (indirect string, offset: 0xc9742): PID1
    <771>   DW_AT_decl_file   : 2
    <771>   DW_AT_decl_line   : 838
    <773>   DW_AT_decl_column : 18
    <773>   DW_AT_type        : <0x626>
    <777>   DW_AT_data_member_location: 4068
 <2><779>: Abbrev Number: 6 (DW_TAG_member)
    <77a>   DW_AT_name        : (indirect string, offset: 0xc91fd): PID2
    <77e>   DW_AT_decl_file   : 2
    <77e>   DW_AT_decl_line   : 839
    <780>   DW_AT_decl_column : 18
    <780>   DW_AT_type        : <0x626>
    <784>   DW_AT_data_member_location: 4072
 <2><786>: Abbrev Number: 6 (DW_TAG_member)
    <787>   DW_AT_name        : (indirect string, offset: 0xc9747): PID3
    <78b>   DW_AT_decl_file   : 2
    <78b>   DW_AT_decl_line   : 840
    <78d>   DW_AT_decl_column : 18
    <78d>   DW_AT_type        : <0x626>
    <791>   DW_AT_data_member_location: 4076
 <2><793>: Abbrev Number: 6 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0xc8e6d): CID0
    <798>   DW_AT_decl_file   : 2
    <798>   DW_AT_decl_line   : 841
    <79a>   DW_AT_decl_column : 18
    <79a>   DW_AT_type        : <0x626>
    <79e>   DW_AT_data_member_location: 4080
 <2><7a0>: Abbrev Number: 6 (DW_TAG_member)
    <7a1>   DW_AT_name        : (indirect string, offset: 0xc8e72): CID1
    <7a5>   DW_AT_decl_file   : 2
    <7a5>   DW_AT_decl_line   : 842
    <7a7>   DW_AT_decl_column : 18
    <7a7>   DW_AT_type        : <0x626>
    <7ab>   DW_AT_data_member_location: 4084
 <2><7ad>: Abbrev Number: 6 (DW_TAG_member)
    <7ae>   DW_AT_name        : (indirect string, offset: 0xc8e77): CID2
    <7b2>   DW_AT_decl_file   : 2
    <7b2>   DW_AT_decl_line   : 843
    <7b4>   DW_AT_decl_column : 18
    <7b4>   DW_AT_type        : <0x626>
    <7b8>   DW_AT_data_member_location: 4088
 <2><7ba>: Abbrev Number: 6 (DW_TAG_member)
    <7bb>   DW_AT_name        : (indirect string, offset: 0xc8e7c): CID3
    <7bf>   DW_AT_decl_file   : 2
    <7bf>   DW_AT_decl_line   : 844
    <7c1>   DW_AT_decl_column : 18
    <7c1>   DW_AT_type        : <0x626>
    <7c5>   DW_AT_data_member_location: 4092
 <2><7c7>: Abbrev Number: 0
 <1><7c8>: Abbrev Number: 12 (DW_TAG_array_type)
    <7c9>   DW_AT_type        : <0x656>
    <7cd>   DW_AT_sibling     : <0x7d8>
 <2><7d1>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <7d2>   DW_AT_type        : <0x5e7>
    <7d6>   DW_AT_upper_bound : 31
 <2><7d7>: Abbrev Number: 0
 <1><7d8>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <7d9>   DW_AT_type        : <0x7c8>
 <1><7dd>: Abbrev Number: 12 (DW_TAG_array_type)
    <7de>   DW_AT_type        : <0x615>
    <7e2>   DW_AT_sibling     : <0x7ee>
 <2><7e6>: Abbrev Number: 36 (DW_TAG_subrange_type)
    <7e7>   DW_AT_type        : <0x5e7>
    <7eb>   DW_AT_upper_bound : 863
 <2><7ed>: Abbrev Number: 0
 <1><7ee>: Abbrev Number: 12 (DW_TAG_array_type)
    <7ef>   DW_AT_type        : <0x615>
    <7f3>   DW_AT_sibling     : <0x7fe>
 <2><7f7>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <7f8>   DW_AT_type        : <0x5e7>
    <7fc>   DW_AT_upper_bound : 14
 <2><7fd>: Abbrev Number: 0
 <1><7fe>: Abbrev Number: 12 (DW_TAG_array_type)
    <7ff>   DW_AT_type        : <0x615>
    <803>   DW_AT_sibling     : <0x80e>
 <2><807>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <808>   DW_AT_type        : <0x5e7>
    <80c>   DW_AT_upper_bound : 28
 <2><80d>: Abbrev Number: 0
 <1><80e>: Abbrev Number: 12 (DW_TAG_array_type)
    <80f>   DW_AT_type        : <0x615>
    <813>   DW_AT_sibling     : <0x81e>
 <2><817>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <818>   DW_AT_type        : <0x5e7>
    <81c>   DW_AT_upper_bound : 42
 <2><81d>: Abbrev Number: 0
 <1><81e>: Abbrev Number: 12 (DW_TAG_array_type)
    <81f>   DW_AT_type        : <0x615>
    <823>   DW_AT_sibling     : <0x82e>
 <2><827>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <828>   DW_AT_type        : <0x5e7>
    <82c>   DW_AT_upper_bound : 5
 <2><82d>: Abbrev Number: 0
 <1><82e>: Abbrev Number: 8 (DW_TAG_typedef)
    <82f>   DW_AT_name        : (indirect string, offset: 0xc978c): ITM_Type
    <833>   DW_AT_decl_file   : 2
    <834>   DW_AT_decl_line   : 845
    <836>   DW_AT_decl_column : 3
    <837>   DW_AT_type        : <0x65b>
 <1><83b>: Abbrev Number: 14 (DW_TAG_structure_type)
    <83c>   DW_AT_byte_size   : 16
    <83d>   DW_AT_decl_file   : 6
    <83e>   DW_AT_decl_line   : 348
    <840>   DW_AT_decl_column : 9
    <840>   DW_AT_sibling     : <0x87d>
 <2><844>: Abbrev Number: 4 (DW_TAG_member)
    <845>   DW_AT_name        : CCR
    <849>   DW_AT_decl_file   : 6
    <84a>   DW_AT_decl_line   : 350
    <84c>   DW_AT_decl_column : 17
    <84d>   DW_AT_type        : <0x621>
    <851>   DW_AT_data_member_location: 0
 <2><852>: Abbrev Number: 1 (DW_TAG_member)
    <853>   DW_AT_name        : (indirect string, offset: 0xc92d0): CNDTR
    <857>   DW_AT_decl_file   : 6
    <858>   DW_AT_decl_line   : 351
    <85a>   DW_AT_decl_column : 17
    <85b>   DW_AT_type        : <0x621>
    <85f>   DW_AT_data_member_location: 4
 <2><860>: Abbrev Number: 1 (DW_TAG_member)
    <861>   DW_AT_name        : (indirect string, offset: 0xc9977): CPAR
    <865>   DW_AT_decl_file   : 6
    <866>   DW_AT_decl_line   : 352
    <868>   DW_AT_decl_column : 17
    <869>   DW_AT_type        : <0x621>
    <86d>   DW_AT_data_member_location: 8
 <2><86e>: Abbrev Number: 1 (DW_TAG_member)
    <86f>   DW_AT_name        : (indirect string, offset: 0xc93f9): CMAR
    <873>   DW_AT_decl_file   : 6
    <874>   DW_AT_decl_line   : 353
    <876>   DW_AT_decl_column : 17
    <877>   DW_AT_type        : <0x621>
    <87b>   DW_AT_data_member_location: 12
 <2><87c>: Abbrev Number: 0
 <1><87d>: Abbrev Number: 8 (DW_TAG_typedef)
    <87e>   DW_AT_name        : (indirect string, offset: 0xc976d): DMA_Channel_TypeDef
    <882>   DW_AT_decl_file   : 6
    <883>   DW_AT_decl_line   : 354
    <885>   DW_AT_decl_column : 3
    <886>   DW_AT_type        : <0x83b>
 <1><88a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <88b>   DW_AT_byte_size   : 8
    <88c>   DW_AT_decl_file   : 6
    <88d>   DW_AT_decl_line   : 356
    <88f>   DW_AT_decl_column : 9
    <88f>   DW_AT_sibling     : <0x8b0>
 <2><893>: Abbrev Number: 4 (DW_TAG_member)
    <894>   DW_AT_name        : ISR
    <898>   DW_AT_decl_file   : 6
    <899>   DW_AT_decl_line   : 358
    <89b>   DW_AT_decl_column : 17
    <89c>   DW_AT_type        : <0x621>
    <8a0>   DW_AT_data_member_location: 0
 <2><8a1>: Abbrev Number: 1 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0xc961c): IFCR
    <8a6>   DW_AT_decl_file   : 6
    <8a7>   DW_AT_decl_line   : 359
    <8a9>   DW_AT_decl_column : 17
    <8aa>   DW_AT_type        : <0x621>
    <8ae>   DW_AT_data_member_location: 4
 <2><8af>: Abbrev Number: 0
 <1><8b0>: Abbrev Number: 8 (DW_TAG_typedef)
    <8b1>   DW_AT_name        : (indirect string, offset: 0xc91a6): DMA_TypeDef
    <8b5>   DW_AT_decl_file   : 6
    <8b6>   DW_AT_decl_line   : 360
    <8b8>   DW_AT_decl_column : 3
    <8b9>   DW_AT_type        : <0x88a>
 <1><8bd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <8be>   DW_AT_byte_size   : 96
    <8bf>   DW_AT_decl_file   : 6
    <8c0>   DW_AT_decl_line   : 650
    <8c2>   DW_AT_decl_column : 9
    <8c2>   DW_AT_sibling     : <0xa15>
 <2><8c6>: Abbrev Number: 4 (DW_TAG_member)
    <8c7>   DW_AT_name        : CR1
    <8cb>   DW_AT_decl_file   : 6
    <8cc>   DW_AT_decl_line   : 652
    <8ce>   DW_AT_decl_column : 17
    <8cf>   DW_AT_type        : <0x621>
    <8d3>   DW_AT_data_member_location: 0
 <2><8d4>: Abbrev Number: 4 (DW_TAG_member)
    <8d5>   DW_AT_name        : CR2
    <8d9>   DW_AT_decl_file   : 6
    <8da>   DW_AT_decl_line   : 653
    <8dc>   DW_AT_decl_column : 17
    <8dd>   DW_AT_type        : <0x621>
    <8e1>   DW_AT_data_member_location: 4
 <2><8e2>: Abbrev Number: 1 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x90a76): SMCR
    <8e7>   DW_AT_decl_file   : 6
    <8e8>   DW_AT_decl_line   : 654
    <8ea>   DW_AT_decl_column : 17
    <8eb>   DW_AT_type        : <0x621>
    <8ef>   DW_AT_data_member_location: 8
 <2><8f0>: Abbrev Number: 1 (DW_TAG_member)
    <8f1>   DW_AT_name        : (indirect string, offset: 0x418c6): DIER
    <8f5>   DW_AT_decl_file   : 6
    <8f6>   DW_AT_decl_line   : 655
    <8f8>   DW_AT_decl_column : 17
    <8f9>   DW_AT_type        : <0x621>
    <8fd>   DW_AT_data_member_location: 12
 <2><8fe>: Abbrev Number: 4 (DW_TAG_member)
    <8ff>   DW_AT_name        : SR
    <902>   DW_AT_decl_file   : 6
    <903>   DW_AT_decl_line   : 656
    <905>   DW_AT_decl_column : 17
    <906>   DW_AT_type        : <0x621>
    <90a>   DW_AT_data_member_location: 16
 <2><90b>: Abbrev Number: 4 (DW_TAG_member)
    <90c>   DW_AT_name        : EGR
    <910>   DW_AT_decl_file   : 6
    <911>   DW_AT_decl_line   : 657
    <913>   DW_AT_decl_column : 17
    <914>   DW_AT_type        : <0x621>
    <918>   DW_AT_data_member_location: 20
 <2><919>: Abbrev Number: 1 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0x6f0df): CCMR1
    <91e>   DW_AT_decl_file   : 6
    <91f>   DW_AT_decl_line   : 658
    <921>   DW_AT_decl_column : 17
    <922>   DW_AT_type        : <0x621>
    <926>   DW_AT_data_member_location: 24
 <2><927>: Abbrev Number: 1 (DW_TAG_member)
    <928>   DW_AT_name        : (indirect string, offset: 0x1680c): CCMR2
    <92c>   DW_AT_decl_file   : 6
    <92d>   DW_AT_decl_line   : 659
    <92f>   DW_AT_decl_column : 17
    <930>   DW_AT_type        : <0x621>
    <934>   DW_AT_data_member_location: 28
 <2><935>: Abbrev Number: 1 (DW_TAG_member)
    <936>   DW_AT_name        : (indirect string, offset: 0x30ab1): CCER
    <93a>   DW_AT_decl_file   : 6
    <93b>   DW_AT_decl_line   : 660
    <93d>   DW_AT_decl_column : 17
    <93e>   DW_AT_type        : <0x621>
    <942>   DW_AT_data_member_location: 32
 <2><943>: Abbrev Number: 4 (DW_TAG_member)
    <944>   DW_AT_name        : CNT
    <948>   DW_AT_decl_file   : 6
    <949>   DW_AT_decl_line   : 661
    <94b>   DW_AT_decl_column : 17
    <94c>   DW_AT_type        : <0x621>
    <950>   DW_AT_data_member_location: 36
 <2><951>: Abbrev Number: 4 (DW_TAG_member)
    <952>   DW_AT_name        : PSC
    <956>   DW_AT_decl_file   : 6
    <957>   DW_AT_decl_line   : 662
    <959>   DW_AT_decl_column : 17
    <95a>   DW_AT_type        : <0x621>
    <95e>   DW_AT_data_member_location: 40
 <2><95f>: Abbrev Number: 4 (DW_TAG_member)
    <960>   DW_AT_name        : ARR
    <964>   DW_AT_decl_file   : 6
    <965>   DW_AT_decl_line   : 663
    <967>   DW_AT_decl_column : 17
    <968>   DW_AT_type        : <0x621>
    <96c>   DW_AT_data_member_location: 44
 <2><96d>: Abbrev Number: 4 (DW_TAG_member)
    <96e>   DW_AT_name        : RCR
    <972>   DW_AT_decl_file   : 6
    <973>   DW_AT_decl_line   : 664
    <975>   DW_AT_decl_column : 17
    <976>   DW_AT_type        : <0x621>
    <97a>   DW_AT_data_member_location: 48
 <2><97b>: Abbrev Number: 1 (DW_TAG_member)
    <97c>   DW_AT_name        : (indirect string, offset: 0x1742b): CCR1
    <980>   DW_AT_decl_file   : 6
    <981>   DW_AT_decl_line   : 665
    <983>   DW_AT_decl_column : 17
    <984>   DW_AT_type        : <0x621>
    <988>   DW_AT_data_member_location: 52
 <2><989>: Abbrev Number: 1 (DW_TAG_member)
    <98a>   DW_AT_name        : (indirect string, offset: 0x5422a): CCR2
    <98e>   DW_AT_decl_file   : 6
    <98f>   DW_AT_decl_line   : 666
    <991>   DW_AT_decl_column : 17
    <992>   DW_AT_type        : <0x621>
    <996>   DW_AT_data_member_location: 56
 <2><997>: Abbrev Number: 1 (DW_TAG_member)
    <998>   DW_AT_name        : (indirect string, offset: 0xa2879): CCR3
    <99c>   DW_AT_decl_file   : 6
    <99d>   DW_AT_decl_line   : 667
    <99f>   DW_AT_decl_column : 17
    <9a0>   DW_AT_type        : <0x621>
    <9a4>   DW_AT_data_member_location: 60
 <2><9a5>: Abbrev Number: 1 (DW_TAG_member)
    <9a6>   DW_AT_name        : (indirect string, offset: 0x3152): CCR4
    <9aa>   DW_AT_decl_file   : 6
    <9ab>   DW_AT_decl_line   : 668
    <9ad>   DW_AT_decl_column : 17
    <9ae>   DW_AT_type        : <0x621>
    <9b2>   DW_AT_data_member_location: 64
 <2><9b3>: Abbrev Number: 1 (DW_TAG_member)
    <9b4>   DW_AT_name        : (indirect string, offset: 0x5c6f2): BDTR
    <9b8>   DW_AT_decl_file   : 6
    <9b9>   DW_AT_decl_line   : 669
    <9bb>   DW_AT_decl_column : 17
    <9bc>   DW_AT_type        : <0x621>
    <9c0>   DW_AT_data_member_location: 68
 <2><9c1>: Abbrev Number: 4 (DW_TAG_member)
    <9c2>   DW_AT_name        : DCR
    <9c6>   DW_AT_decl_file   : 6
    <9c7>   DW_AT_decl_line   : 670
    <9c9>   DW_AT_decl_column : 17
    <9ca>   DW_AT_type        : <0x621>
    <9ce>   DW_AT_data_member_location: 72
 <2><9cf>: Abbrev Number: 1 (DW_TAG_member)
    <9d0>   DW_AT_name        : (indirect string, offset: 0x95563): DMAR
    <9d4>   DW_AT_decl_file   : 6
    <9d5>   DW_AT_decl_line   : 671
    <9d7>   DW_AT_decl_column : 17
    <9d8>   DW_AT_type        : <0x621>
    <9dc>   DW_AT_data_member_location: 76
 <2><9dd>: Abbrev Number: 4 (DW_TAG_member)
    <9de>   DW_AT_name        : OR
    <9e1>   DW_AT_decl_file   : 6
    <9e2>   DW_AT_decl_line   : 672
    <9e4>   DW_AT_decl_column : 17
    <9e5>   DW_AT_type        : <0x621>
    <9e9>   DW_AT_data_member_location: 80
 <2><9ea>: Abbrev Number: 1 (DW_TAG_member)
    <9eb>   DW_AT_name        : (indirect string, offset: 0xb2fc6): CCMR3
    <9ef>   DW_AT_decl_file   : 6
    <9f0>   DW_AT_decl_line   : 673
    <9f2>   DW_AT_decl_column : 17
    <9f3>   DW_AT_type        : <0x621>
    <9f7>   DW_AT_data_member_location: 84
 <2><9f8>: Abbrev Number: 1 (DW_TAG_member)
    <9f9>   DW_AT_name        : (indirect string, offset: 0x48b22): CCR5
    <9fd>   DW_AT_decl_file   : 6
    <9fe>   DW_AT_decl_line   : 674
    <a00>   DW_AT_decl_column : 17
    <a01>   DW_AT_type        : <0x621>
    <a05>   DW_AT_data_member_location: 88
 <2><a06>: Abbrev Number: 1 (DW_TAG_member)
    <a07>   DW_AT_name        : (indirect string, offset: 0x8e321): CCR6
    <a0b>   DW_AT_decl_file   : 6
    <a0c>   DW_AT_decl_line   : 675
    <a0e>   DW_AT_decl_column : 17
    <a0f>   DW_AT_type        : <0x621>
    <a13>   DW_AT_data_member_location: 92
 <2><a14>: Abbrev Number: 0
 <1><a15>: Abbrev Number: 8 (DW_TAG_typedef)
    <a16>   DW_AT_name        : (indirect string, offset: 0xc9952): TIM_TypeDef
    <a1a>   DW_AT_decl_file   : 6
    <a1b>   DW_AT_decl_line   : 676
    <a1d>   DW_AT_decl_column : 3
    <a1e>   DW_AT_type        : <0x8bd>
 <1><a22>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a23>   DW_AT_byte_size   : 44
    <a24>   DW_AT_decl_file   : 6
    <a25>   DW_AT_decl_line   : 703
    <a27>   DW_AT_decl_column : 9
    <a27>   DW_AT_sibling     : <0xae2>
 <2><a2b>: Abbrev Number: 4 (DW_TAG_member)
    <a2c>   DW_AT_name        : CR1
    <a30>   DW_AT_decl_file   : 6
    <a31>   DW_AT_decl_line   : 705
    <a33>   DW_AT_decl_column : 17
    <a34>   DW_AT_type        : <0x621>
    <a38>   DW_AT_data_member_location: 0
 <2><a39>: Abbrev Number: 4 (DW_TAG_member)
    <a3a>   DW_AT_name        : CR2
    <a3e>   DW_AT_decl_file   : 6
    <a3f>   DW_AT_decl_line   : 706
    <a41>   DW_AT_decl_column : 17
    <a42>   DW_AT_type        : <0x621>
    <a46>   DW_AT_data_member_location: 4
 <2><a47>: Abbrev Number: 4 (DW_TAG_member)
    <a48>   DW_AT_name        : CR3
    <a4c>   DW_AT_decl_file   : 6
    <a4d>   DW_AT_decl_line   : 707
    <a4f>   DW_AT_decl_column : 17
    <a50>   DW_AT_type        : <0x621>
    <a54>   DW_AT_data_member_location: 8
 <2><a55>: Abbrev Number: 4 (DW_TAG_member)
    <a56>   DW_AT_name        : BRR
    <a5a>   DW_AT_decl_file   : 6
    <a5b>   DW_AT_decl_line   : 708
    <a5d>   DW_AT_decl_column : 17
    <a5e>   DW_AT_type        : <0x621>
    <a62>   DW_AT_data_member_location: 12
 <2><a63>: Abbrev Number: 1 (DW_TAG_member)
    <a64>   DW_AT_name        : (indirect string, offset: 0xc90cd): GTPR
    <a68>   DW_AT_decl_file   : 6
    <a69>   DW_AT_decl_line   : 709
    <a6b>   DW_AT_decl_column : 17
    <a6c>   DW_AT_type        : <0x621>
    <a70>   DW_AT_data_member_location: 16
 <2><a71>: Abbrev Number: 1 (DW_TAG_member)
    <a72>   DW_AT_name        : (indirect string, offset: 0xc9892): RTOR
    <a76>   DW_AT_decl_file   : 6
    <a77>   DW_AT_decl_line   : 710
    <a79>   DW_AT_decl_column : 17
    <a7a>   DW_AT_type        : <0x621>
    <a7e>   DW_AT_data_member_location: 20
 <2><a7f>: Abbrev Number: 4 (DW_TAG_member)
    <a80>   DW_AT_name        : RQR
    <a84>   DW_AT_decl_file   : 6
    <a85>   DW_AT_decl_line   : 711
    <a87>   DW_AT_decl_column : 17
    <a88>   DW_AT_type        : <0x621>
    <a8c>   DW_AT_data_member_location: 24
 <2><a8d>: Abbrev Number: 4 (DW_TAG_member)
    <a8e>   DW_AT_name        : ISR
    <a92>   DW_AT_decl_file   : 6
    <a93>   DW_AT_decl_line   : 712
    <a95>   DW_AT_decl_column : 17
    <a96>   DW_AT_type        : <0x621>
    <a9a>   DW_AT_data_member_location: 28
 <2><a9b>: Abbrev Number: 4 (DW_TAG_member)
    <a9c>   DW_AT_name        : ICR
    <aa0>   DW_AT_decl_file   : 6
    <aa1>   DW_AT_decl_line   : 713
    <aa3>   DW_AT_decl_column : 17
    <aa4>   DW_AT_type        : <0x621>
    <aa8>   DW_AT_data_member_location: 32
 <2><aa9>: Abbrev Number: 4 (DW_TAG_member)
    <aaa>   DW_AT_name        : RDR
    <aae>   DW_AT_decl_file   : 6
    <aaf>   DW_AT_decl_line   : 714
    <ab1>   DW_AT_decl_column : 17
    <ab2>   DW_AT_type        : <0x610>
    <ab6>   DW_AT_data_member_location: 36
 <2><ab7>: Abbrev Number: 1 (DW_TAG_member)
    <ab8>   DW_AT_name        : (indirect string, offset: 0xc992a): RESERVED1
    <abc>   DW_AT_decl_file   : 6
    <abd>   DW_AT_decl_line   : 715
    <abf>   DW_AT_decl_column : 13
    <ac0>   DW_AT_type        : <0x604>
    <ac4>   DW_AT_data_member_location: 38
 <2><ac5>: Abbrev Number: 4 (DW_TAG_member)
    <ac6>   DW_AT_name        : TDR
    <aca>   DW_AT_decl_file   : 6
    <acb>   DW_AT_decl_line   : 716
    <acd>   DW_AT_decl_column : 17
    <ace>   DW_AT_type        : <0x610>
    <ad2>   DW_AT_data_member_location: 40
 <2><ad3>: Abbrev Number: 1 (DW_TAG_member)
    <ad4>   DW_AT_name        : (indirect string, offset: 0xc9934): RESERVED2
    <ad8>   DW_AT_decl_file   : 6
    <ad9>   DW_AT_decl_line   : 717
    <adb>   DW_AT_decl_column : 13
    <adc>   DW_AT_type        : <0x604>
    <ae0>   DW_AT_data_member_location: 42
 <2><ae1>: Abbrev Number: 0
 <1><ae2>: Abbrev Number: 8 (DW_TAG_typedef)
    <ae3>   DW_AT_name        : (indirect string, offset: 0xc9389): USART_TypeDef
    <ae7>   DW_AT_decl_file   : 6
    <ae8>   DW_AT_decl_line   : 718
    <aea>   DW_AT_decl_column : 3
    <aeb>   DW_AT_type        : <0xa22>
 <1><aef>: Abbrev Number: 10 (DW_TAG_base_type)
    <af0>   DW_AT_byte_size   : 8
    <af1>   DW_AT_encoding    : 4	(float)
    <af2>   DW_AT_name        : (indirect string, offset: 0x11ed1): long double
 <1><af6>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <af7>   DW_AT_encoding    : 7	(unsigned)
    <af8>   DW_AT_byte_size   : 1
    <af9>   DW_AT_type        : <0x597>
    <afd>   DW_AT_decl_file   : 7
    <afe>   DW_AT_decl_line   : 39
    <aff>   DW_AT_decl_column : 1
    <b00>   DW_AT_sibling     : <0xb1d>
 <2><b04>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b05>   DW_AT_name        : (indirect string, offset: 0xc9152): HAL_OK
    <b09>   DW_AT_const_value : 0
 <2><b0a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b0b>   DW_AT_name        : (indirect string, offset: 0xc955d): HAL_ERROR
    <b0f>   DW_AT_const_value : 1
 <2><b10>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b11>   DW_AT_name        : (indirect string, offset: 0xc900e): HAL_BUSY
    <b15>   DW_AT_const_value : 2
 <2><b16>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b17>   DW_AT_name        : (indirect string, offset: 0xc90ed): HAL_TIMEOUT
    <b1b>   DW_AT_const_value : 3
 <2><b1c>: Abbrev Number: 0
 <1><b1d>: Abbrev Number: 5 (DW_TAG_typedef)
    <b1e>   DW_AT_name        : (indirect string, offset: 0xc8e95): HAL_StatusTypeDef
    <b22>   DW_AT_decl_file   : 7
    <b23>   DW_AT_decl_line   : 44
    <b24>   DW_AT_decl_column : 3
    <b25>   DW_AT_type        : <0xaf6>
 <1><b29>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <b2a>   DW_AT_encoding    : 7	(unsigned)
    <b2b>   DW_AT_byte_size   : 1
    <b2c>   DW_AT_type        : <0x597>
    <b30>   DW_AT_decl_file   : 7
    <b31>   DW_AT_decl_line   : 50
    <b32>   DW_AT_decl_column : 1
    <b33>   DW_AT_sibling     : <0xb44>
 <2><b37>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b38>   DW_AT_name        : (indirect string, offset: 0xc965b): HAL_UNLOCKED
    <b3c>   DW_AT_const_value : 0
 <2><b3d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b3e>   DW_AT_name        : (indirect string, offset: 0xc99ce): HAL_LOCKED
    <b42>   DW_AT_const_value : 1
 <2><b43>: Abbrev Number: 0
 <1><b44>: Abbrev Number: 5 (DW_TAG_typedef)
    <b45>   DW_AT_name        : (indirect string, offset: 0xc94a3): HAL_LockTypeDef
    <b49>   DW_AT_decl_file   : 7
    <b4a>   DW_AT_decl_line   : 53
    <b4b>   DW_AT_decl_column : 3
    <b4c>   DW_AT_type        : <0xb29>
 <1><b50>: Abbrev Number: 17 (DW_TAG_structure_type)
    <b51>   DW_AT_byte_size   : 16
    <b52>   DW_AT_decl_file   : 8
    <b53>   DW_AT_decl_line   : 249
    <b54>   DW_AT_decl_column : 9
    <b54>   DW_AT_sibling     : <0xb8f>
 <2><b58>: Abbrev Number: 2 (DW_TAG_member)
    <b59>   DW_AT_name        : (indirect string, offset: 0xc95bd): PLLState
    <b5d>   DW_AT_decl_file   : 8
    <b5e>   DW_AT_decl_line   : 251
    <b5f>   DW_AT_decl_column : 12
    <b60>   DW_AT_type        : <0x615>
    <b64>   DW_AT_data_member_location: 0
 <2><b65>: Abbrev Number: 2 (DW_TAG_member)
    <b66>   DW_AT_name        : (indirect string, offset: 0xc9612): PLLSource
    <b6a>   DW_AT_decl_file   : 8
    <b6b>   DW_AT_decl_line   : 254
    <b6c>   DW_AT_decl_column : 12
    <b6d>   DW_AT_type        : <0x615>
    <b71>   DW_AT_data_member_location: 4
 <2><b72>: Abbrev Number: 1 (DW_TAG_member)
    <b73>   DW_AT_name        : (indirect string, offset: 0xc98b3): PLLMUL
    <b77>   DW_AT_decl_file   : 8
    <b78>   DW_AT_decl_line   : 257
    <b7a>   DW_AT_decl_column : 12
    <b7b>   DW_AT_type        : <0x615>
    <b7f>   DW_AT_data_member_location: 8
 <2><b80>: Abbrev Number: 1 (DW_TAG_member)
    <b81>   DW_AT_name        : (indirect string, offset: 0x9a652): PREDIV
    <b85>   DW_AT_decl_file   : 8
    <b86>   DW_AT_decl_line   : 261
    <b88>   DW_AT_decl_column : 12
    <b89>   DW_AT_type        : <0x615>
    <b8d>   DW_AT_data_member_location: 12
 <2><b8e>: Abbrev Number: 0
 <1><b8f>: Abbrev Number: 8 (DW_TAG_typedef)
    <b90>   DW_AT_name        : (indirect string, offset: 0xc950e): RCC_PLLInitTypeDef
    <b94>   DW_AT_decl_file   : 8
    <b95>   DW_AT_decl_line   : 265
    <b97>   DW_AT_decl_column : 3
    <b98>   DW_AT_type        : <0xb50>
 <1><b9c>: Abbrev Number: 14 (DW_TAG_structure_type)
    <b9d>   DW_AT_byte_size   : 40
    <b9e>   DW_AT_decl_file   : 8
    <b9f>   DW_AT_decl_line   : 270
    <ba1>   DW_AT_decl_column : 9
    <ba1>   DW_AT_sibling     : <0xc08>
 <2><ba5>: Abbrev Number: 1 (DW_TAG_member)
    <ba6>   DW_AT_name        : (indirect string, offset: 0xc8f5a): OscillatorType
    <baa>   DW_AT_decl_file   : 8
    <bab>   DW_AT_decl_line   : 272
    <bad>   DW_AT_decl_column : 12
    <bae>   DW_AT_type        : <0x615>
    <bb2>   DW_AT_data_member_location: 0
 <2><bb3>: Abbrev Number: 1 (DW_TAG_member)
    <bb4>   DW_AT_name        : (indirect string, offset: 0xc95d1): HSEState
    <bb8>   DW_AT_decl_file   : 8
    <bb9>   DW_AT_decl_line   : 275
    <bbb>   DW_AT_decl_column : 12
    <bbc>   DW_AT_type        : <0x615>
    <bc0>   DW_AT_data_member_location: 4
 <2><bc1>: Abbrev Number: 1 (DW_TAG_member)
    <bc2>   DW_AT_name        : (indirect string, offset: 0xc9567): LSEState
    <bc6>   DW_AT_decl_file   : 8
    <bc7>   DW_AT_decl_line   : 283
    <bc9>   DW_AT_decl_column : 12
    <bca>   DW_AT_type        : <0x615>
    <bce>   DW_AT_data_member_location: 8
 <2><bcf>: Abbrev Number: 1 (DW_TAG_member)
    <bd0>   DW_AT_name        : (indirect string, offset: 0xc92b8): HSIState
    <bd4>   DW_AT_decl_file   : 8
    <bd5>   DW_AT_decl_line   : 286
    <bd7>   DW_AT_decl_column : 12
    <bd8>   DW_AT_type        : <0x615>
    <bdc>   DW_AT_data_member_location: 12
 <2><bdd>: Abbrev Number: 1 (DW_TAG_member)
    <bde>   DW_AT_name        : (indirect string, offset: 0xc9878): HSICalibrationValue
    <be2>   DW_AT_decl_file   : 8
    <be3>   DW_AT_decl_line   : 289
    <be5>   DW_AT_decl_column : 12
    <be6>   DW_AT_type        : <0x615>
    <bea>   DW_AT_data_member_location: 16
 <2><beb>: Abbrev Number: 1 (DW_TAG_member)
    <bec>   DW_AT_name        : (indirect string, offset: 0xc98aa): LSIState
    <bf0>   DW_AT_decl_file   : 8
    <bf1>   DW_AT_decl_line   : 292
    <bf3>   DW_AT_decl_column : 12
    <bf4>   DW_AT_type        : <0x615>
    <bf8>   DW_AT_data_member_location: 20
 <2><bf9>: Abbrev Number: 4 (DW_TAG_member)
    <bfa>   DW_AT_name        : PLL
    <bfe>   DW_AT_decl_file   : 8
    <bff>   DW_AT_decl_line   : 295
    <c01>   DW_AT_decl_column : 22
    <c02>   DW_AT_type        : <0xb8f>
    <c06>   DW_AT_data_member_location: 24
 <2><c07>: Abbrev Number: 0
 <1><c08>: Abbrev Number: 8 (DW_TAG_typedef)
    <c09>   DW_AT_name        : (indirect string, offset: 0xc9376): RCC_OscInitTypeDef
    <c0d>   DW_AT_decl_file   : 8
    <c0e>   DW_AT_decl_line   : 297
    <c10>   DW_AT_decl_column : 3
    <c11>   DW_AT_type        : <0xb9c>
 <1><c15>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c16>   DW_AT_byte_size   : 20
    <c17>   DW_AT_decl_file   : 8
    <c18>   DW_AT_decl_line   : 302
    <c1a>   DW_AT_decl_column : 9
    <c1a>   DW_AT_sibling     : <0xc65>
 <2><c1e>: Abbrev Number: 1 (DW_TAG_member)
    <c1f>   DW_AT_name        : (indirect string, offset: 0xc910f): ClockType
    <c23>   DW_AT_decl_file   : 8
    <c24>   DW_AT_decl_line   : 304
    <c26>   DW_AT_decl_column : 12
    <c27>   DW_AT_type        : <0x615>
    <c2b>   DW_AT_data_member_location: 0
 <2><c2c>: Abbrev Number: 1 (DW_TAG_member)
    <c2d>   DW_AT_name        : (indirect string, offset: 0xc9501): SYSCLKSource
    <c31>   DW_AT_decl_file   : 8
    <c32>   DW_AT_decl_line   : 307
    <c34>   DW_AT_decl_column : 12
    <c35>   DW_AT_type        : <0x615>
    <c39>   DW_AT_data_member_location: 4
 <2><c3a>: Abbrev Number: 1 (DW_TAG_member)
    <c3b>   DW_AT_name        : (indirect string, offset: 0xc97a9): AHBCLKDivider
    <c3f>   DW_AT_decl_file   : 8
    <c40>   DW_AT_decl_line   : 310
    <c42>   DW_AT_decl_column : 12
    <c43>   DW_AT_type        : <0x615>
    <c47>   DW_AT_data_member_location: 8
 <2><c48>: Abbrev Number: 1 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0xc8f8a): APB1CLKDivider
    <c4d>   DW_AT_decl_file   : 8
    <c4e>   DW_AT_decl_line   : 313
    <c50>   DW_AT_decl_column : 12
    <c51>   DW_AT_type        : <0x615>
    <c55>   DW_AT_data_member_location: 12
 <2><c56>: Abbrev Number: 1 (DW_TAG_member)
    <c57>   DW_AT_name        : (indirect string, offset: 0xc92c1): APB2CLKDivider
    <c5b>   DW_AT_decl_file   : 8
    <c5c>   DW_AT_decl_line   : 316
    <c5e>   DW_AT_decl_column : 12
    <c5f>   DW_AT_type        : <0x615>
    <c63>   DW_AT_data_member_location: 16
 <2><c64>: Abbrev Number: 0
 <1><c65>: Abbrev Number: 8 (DW_TAG_typedef)
    <c66>   DW_AT_name        : (indirect string, offset: 0xc96f5): RCC_ClkInitTypeDef
    <c6a>   DW_AT_decl_file   : 8
    <c6b>   DW_AT_decl_line   : 318
    <c6d>   DW_AT_decl_column : 3
    <c6e>   DW_AT_type        : <0xc15>
 <1><c72>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c73>   DW_AT_byte_size   : 88
    <c74>   DW_AT_decl_file   : 9
    <c75>   DW_AT_decl_line   : 598
    <c77>   DW_AT_decl_column : 9
    <c77>   DW_AT_sibling     : <0xdb0>
 <2><c7b>: Abbrev Number: 1 (DW_TAG_member)
    <c7c>   DW_AT_name        : (indirect string, offset: 0xc982a): PeriphClockSelection
    <c80>   DW_AT_decl_file   : 9
    <c81>   DW_AT_decl_line   : 600
    <c83>   DW_AT_decl_column : 12
    <c84>   DW_AT_type        : <0x615>
    <c88>   DW_AT_data_member_location: 0
 <2><c89>: Abbrev Number: 1 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0xc926c): RTCClockSelection
    <c8e>   DW_AT_decl_file   : 9
    <c8f>   DW_AT_decl_line   : 603
    <c91>   DW_AT_decl_column : 12
    <c92>   DW_AT_type        : <0x615>
    <c96>   DW_AT_data_member_location: 4
 <2><c97>: Abbrev Number: 1 (DW_TAG_member)
    <c98>   DW_AT_name        : (indirect string, offset: 0xc939e): Usart1ClockSelection
    <c9c>   DW_AT_decl_file   : 9
    <c9d>   DW_AT_decl_line   : 606
    <c9f>   DW_AT_decl_column : 12
    <ca0>   DW_AT_type        : <0x615>
    <ca4>   DW_AT_data_member_location: 8
 <2><ca5>: Abbrev Number: 1 (DW_TAG_member)
    <ca6>   DW_AT_name        : (indirect string, offset: 0xc96e0): Usart2ClockSelection
    <caa>   DW_AT_decl_file   : 9
    <cab>   DW_AT_decl_line   : 609
    <cad>   DW_AT_decl_column : 12
    <cae>   DW_AT_type        : <0x615>
    <cb2>   DW_AT_data_member_location: 12
 <2><cb3>: Abbrev Number: 1 (DW_TAG_member)
    <cb4>   DW_AT_name        : (indirect string, offset: 0xc8eef): Usart3ClockSelection
    <cb8>   DW_AT_decl_file   : 9
    <cb9>   DW_AT_decl_line   : 612
    <cbb>   DW_AT_decl_column : 12
    <cbc>   DW_AT_type        : <0x615>
    <cc0>   DW_AT_data_member_location: 16
 <2><cc1>: Abbrev Number: 1 (DW_TAG_member)
    <cc2>   DW_AT_name        : (indirect string, offset: 0xc8ffa): Uart4ClockSelection
    <cc6>   DW_AT_decl_file   : 9
    <cc7>   DW_AT_decl_line   : 615
    <cc9>   DW_AT_decl_column : 12
    <cca>   DW_AT_type        : <0x615>
    <cce>   DW_AT_data_member_location: 20
 <2><ccf>: Abbrev Number: 1 (DW_TAG_member)
    <cd0>   DW_AT_name        : (indirect string, offset: 0xc928d): Uart5ClockSelection
    <cd4>   DW_AT_decl_file   : 9
    <cd5>   DW_AT_decl_line   : 618
    <cd7>   DW_AT_decl_column : 12
    <cd8>   DW_AT_type        : <0x615>
    <cdc>   DW_AT_data_member_location: 24
 <2><cdd>: Abbrev Number: 1 (DW_TAG_member)
    <cde>   DW_AT_name        : (indirect string, offset: 0xc9648): I2c1ClockSelection
    <ce2>   DW_AT_decl_file   : 9
    <ce3>   DW_AT_decl_line   : 621
    <ce5>   DW_AT_decl_column : 12
    <ce6>   DW_AT_type        : <0x615>
    <cea>   DW_AT_data_member_location: 28
 <2><ceb>: Abbrev Number: 1 (DW_TAG_member)
    <cec>   DW_AT_name        : (indirect string, offset: 0xc8e5a): I2c2ClockSelection
    <cf0>   DW_AT_decl_file   : 9
    <cf1>   DW_AT_decl_line   : 624
    <cf3>   DW_AT_decl_column : 12
    <cf4>   DW_AT_type        : <0x615>
    <cf8>   DW_AT_data_member_location: 32
 <2><cf9>: Abbrev Number: 1 (DW_TAG_member)
    <cfa>   DW_AT_name        : (indirect string, offset: 0xc90ba): I2c3ClockSelection
    <cfe>   DW_AT_decl_file   : 9
    <cff>   DW_AT_decl_line   : 627
    <d01>   DW_AT_decl_column : 12
    <d02>   DW_AT_type        : <0x615>
    <d06>   DW_AT_data_member_location: 36
 <2><d07>: Abbrev Number: 1 (DW_TAG_member)
    <d08>   DW_AT_name        : (indirect string, offset: 0xc974c): Adc12ClockSelection
    <d0c>   DW_AT_decl_file   : 9
    <d0d>   DW_AT_decl_line   : 630
    <d0f>   DW_AT_decl_column : 12
    <d10>   DW_AT_type        : <0x615>
    <d14>   DW_AT_data_member_location: 40
 <2><d15>: Abbrev Number: 1 (DW_TAG_member)
    <d16>   DW_AT_name        : (indirect string, offset: 0xc91db): Adc34ClockSelection
    <d1a>   DW_AT_decl_file   : 9
    <d1b>   DW_AT_decl_line   : 633
    <d1d>   DW_AT_decl_column : 12
    <d1e>   DW_AT_type        : <0x615>
    <d22>   DW_AT_data_member_location: 44
 <2><d23>: Abbrev Number: 1 (DW_TAG_member)
    <d24>   DW_AT_name        : (indirect string, offset: 0xc9965): I2sClockSelection
    <d28>   DW_AT_decl_file   : 9
    <d29>   DW_AT_decl_line   : 636
    <d2b>   DW_AT_decl_column : 12
    <d2c>   DW_AT_type        : <0x615>
    <d30>   DW_AT_data_member_location: 48
 <2><d31>: Abbrev Number: 1 (DW_TAG_member)
    <d32>   DW_AT_name        : (indirect string, offset: 0xc947b): Tim1ClockSelection
    <d36>   DW_AT_decl_file   : 9
    <d37>   DW_AT_decl_line   : 639
    <d39>   DW_AT_decl_column : 12
    <d3a>   DW_AT_type        : <0x615>
    <d3e>   DW_AT_data_member_location: 52
 <2><d3f>: Abbrev Number: 1 (DW_TAG_member)
    <d40>   DW_AT_name        : (indirect string, offset: 0xc9817): Tim2ClockSelection
    <d44>   DW_AT_decl_file   : 9
    <d45>   DW_AT_decl_line   : 642
    <d47>   DW_AT_decl_column : 12
    <d48>   DW_AT_type        : <0x615>
    <d4c>   DW_AT_data_member_location: 56
 <2><d4d>: Abbrev Number: 1 (DW_TAG_member)
    <d4e>   DW_AT_name        : (indirect string, offset: 0xc94e1): Tim34ClockSelection
    <d52>   DW_AT_decl_file   : 9
    <d53>   DW_AT_decl_line   : 645
    <d55>   DW_AT_decl_column : 12
    <d56>   DW_AT_type        : <0x615>
    <d5a>   DW_AT_data_member_location: 60
 <2><d5b>: Abbrev Number: 1 (DW_TAG_member)
    <d5c>   DW_AT_name        : (indirect string, offset: 0xc918c): Tim8ClockSelection
    <d60>   DW_AT_decl_file   : 9
    <d61>   DW_AT_decl_line   : 648
    <d63>   DW_AT_decl_column : 12
    <d64>   DW_AT_type        : <0x615>
    <d68>   DW_AT_data_member_location: 64
 <2><d69>: Abbrev Number: 1 (DW_TAG_member)
    <d6a>   DW_AT_name        : (indirect string, offset: 0xc9668): Tim15ClockSelection
    <d6e>   DW_AT_decl_file   : 9
    <d6f>   DW_AT_decl_line   : 651
    <d71>   DW_AT_decl_column : 12
    <d72>   DW_AT_type        : <0x615>
    <d76>   DW_AT_data_member_location: 68
 <2><d77>: Abbrev Number: 1 (DW_TAG_member)
    <d78>   DW_AT_name        : (indirect string, offset: 0xc8e81): Tim16ClockSelection
    <d7c>   DW_AT_decl_file   : 9
    <d7d>   DW_AT_decl_line   : 654
    <d7f>   DW_AT_decl_column : 12
    <d80>   DW_AT_type        : <0x615>
    <d84>   DW_AT_data_member_location: 72
 <2><d85>: Abbrev Number: 1 (DW_TAG_member)
    <d86>   DW_AT_name        : (indirect string, offset: 0xc906f): Tim17ClockSelection
    <d8a>   DW_AT_decl_file   : 9
    <d8b>   DW_AT_decl_line   : 657
    <d8d>   DW_AT_decl_column : 12
    <d8e>   DW_AT_type        : <0x615>
    <d92>   DW_AT_data_member_location: 76
 <2><d93>: Abbrev Number: 1 (DW_TAG_member)
    <d94>   DW_AT_name        : (indirect string, offset: 0xc9362): Tim20ClockSelection
    <d98>   DW_AT_decl_file   : 9
    <d99>   DW_AT_decl_line   : 660
    <d9b>   DW_AT_decl_column : 12
    <d9c>   DW_AT_type        : <0x615>
    <da0>   DW_AT_data_member_location: 80
 <2><da1>: Abbrev Number: 1 (DW_TAG_member)
    <da2>   DW_AT_name        : (indirect string, offset: 0xc930c): USBClockSelection
    <da6>   DW_AT_decl_file   : 9
    <da7>   DW_AT_decl_line   : 663
    <da9>   DW_AT_decl_column : 12
    <daa>   DW_AT_type        : <0x615>
    <dae>   DW_AT_data_member_location: 84
 <2><daf>: Abbrev Number: 0
 <1><db0>: Abbrev Number: 8 (DW_TAG_typedef)
    <db1>   DW_AT_name        : (indirect string, offset: 0xc9544): RCC_PeriphCLKInitTypeDef
    <db5>   DW_AT_decl_file   : 9
    <db6>   DW_AT_decl_line   : 666
    <db8>   DW_AT_decl_column : 2
    <db9>   DW_AT_type        : <0xc72>
 <1><dbd>: Abbrev Number: 17 (DW_TAG_structure_type)
    <dbe>   DW_AT_byte_size   : 28
    <dbf>   DW_AT_decl_file   : 10
    <dc0>   DW_AT_decl_line   : 47
    <dc1>   DW_AT_decl_column : 9
    <dc1>   DW_AT_sibling     : <0xe21>
 <2><dc5>: Abbrev Number: 2 (DW_TAG_member)
    <dc6>   DW_AT_name        : (indirect string, offset: 0xc91bf): Direction
    <dca>   DW_AT_decl_file   : 10
    <dcb>   DW_AT_decl_line   : 49
    <dcc>   DW_AT_decl_column : 12
    <dcd>   DW_AT_type        : <0x615>
    <dd1>   DW_AT_data_member_location: 0
 <2><dd2>: Abbrev Number: 2 (DW_TAG_member)
    <dd3>   DW_AT_name        : (indirect string, offset: 0xc8f69): PeriphInc
    <dd7>   DW_AT_decl_file   : 10
    <dd8>   DW_AT_decl_line   : 53
    <dd9>   DW_AT_decl_column : 12
    <dda>   DW_AT_type        : <0x615>
    <dde>   DW_AT_data_member_location: 4
 <2><ddf>: Abbrev Number: 2 (DW_TAG_member)
    <de0>   DW_AT_name        : (indirect string, offset: 0xc8ff3): MemInc
    <de4>   DW_AT_decl_file   : 10
    <de5>   DW_AT_decl_line   : 56
    <de6>   DW_AT_decl_column : 12
    <de7>   DW_AT_type        : <0x615>
    <deb>   DW_AT_data_member_location: 8
 <2><dec>: Abbrev Number: 2 (DW_TAG_member)
    <ded>   DW_AT_name        : (indirect string, offset: 0xc931e): PeriphDataAlignment
    <df1>   DW_AT_decl_file   : 10
    <df2>   DW_AT_decl_line   : 59
    <df3>   DW_AT_decl_column : 12
    <df4>   DW_AT_type        : <0x615>
    <df8>   DW_AT_data_member_location: 12
 <2><df9>: Abbrev Number: 2 (DW_TAG_member)
    <dfa>   DW_AT_name        : (indirect string, offset: 0xc98c2): MemDataAlignment
    <dfe>   DW_AT_decl_file   : 10
    <dff>   DW_AT_decl_line   : 62
    <e00>   DW_AT_decl_column : 12
    <e01>   DW_AT_type        : <0x615>
    <e05>   DW_AT_data_member_location: 16
 <2><e06>: Abbrev Number: 2 (DW_TAG_member)
    <e07>   DW_AT_name        : (indirect string, offset: 0xcb5b4): Mode
    <e0b>   DW_AT_decl_file   : 10
    <e0c>   DW_AT_decl_line   : 65
    <e0d>   DW_AT_decl_column : 12
    <e0e>   DW_AT_type        : <0x615>
    <e12>   DW_AT_data_member_location: 20
 <2><e13>: Abbrev Number: 2 (DW_TAG_member)
    <e14>   DW_AT_name        : (indirect string, offset: 0xca69e): Priority
    <e18>   DW_AT_decl_file   : 10
    <e19>   DW_AT_decl_line   : 70
    <e1a>   DW_AT_decl_column : 12
    <e1b>   DW_AT_type        : <0x615>
    <e1f>   DW_AT_data_member_location: 24
 <2><e20>: Abbrev Number: 0
 <1><e21>: Abbrev Number: 5 (DW_TAG_typedef)
    <e22>   DW_AT_name        : (indirect string, offset: 0xc9096): DMA_InitTypeDef
    <e26>   DW_AT_decl_file   : 10
    <e27>   DW_AT_decl_line   : 72
    <e28>   DW_AT_decl_column : 3
    <e29>   DW_AT_type        : <0xdbd>
 <1><e2d>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <e2e>   DW_AT_encoding    : 7	(unsigned)
    <e2f>   DW_AT_byte_size   : 1
    <e30>   DW_AT_type        : <0x597>
    <e34>   DW_AT_decl_file   : 10
    <e35>   DW_AT_decl_line   : 78
    <e36>   DW_AT_decl_column : 1
    <e37>   DW_AT_sibling     : <0xe54>
 <2><e3b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e3c>   DW_AT_name        : (indirect string, offset: 0xc9697): HAL_DMA_STATE_RESET
    <e40>   DW_AT_const_value : 0
 <2><e41>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e42>   DW_AT_name        : (indirect string, offset: 0xc90a6): HAL_DMA_STATE_READY
    <e46>   DW_AT_const_value : 1
 <2><e47>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e48>   DW_AT_name        : (indirect string, offset: 0xc95ff): HAL_DMA_STATE_BUSY
    <e4c>   DW_AT_const_value : 2
 <2><e4d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e4e>   DW_AT_name        : (indirect string, offset: 0xc99a7): HAL_DMA_STATE_TIMEOUT
    <e52>   DW_AT_const_value : 3
 <2><e53>: Abbrev Number: 0
 <1><e54>: Abbrev Number: 5 (DW_TAG_typedef)
    <e55>   DW_AT_name        : (indirect string, offset: 0xc95a8): HAL_DMA_StateTypeDef
    <e59>   DW_AT_decl_file   : 10
    <e5a>   DW_AT_decl_line   : 83
    <e5b>   DW_AT_decl_column : 2
    <e5c>   DW_AT_type        : <0xe2d>
 <1><e60>: Abbrev Number: 28 (DW_TAG_structure_type)
    <e61>   DW_AT_name        : (indirect string, offset: 0xc9850): __DMA_HandleTypeDef
    <e65>   DW_AT_byte_size   : 68
    <e66>   DW_AT_decl_file   : 10
    <e67>   DW_AT_decl_line   : 109
    <e68>   DW_AT_decl_column : 16
    <e68>   DW_AT_sibling     : <0xf09>
 <2><e6c>: Abbrev Number: 2 (DW_TAG_member)
    <e6d>   DW_AT_name        : (indirect string, offset: 0xc91ef): Instance
    <e71>   DW_AT_decl_file   : 10
    <e72>   DW_AT_decl_line   : 111
    <e73>   DW_AT_decl_column : 26
    <e74>   DW_AT_type        : <0xf09>
    <e78>   DW_AT_data_member_location: 0
 <2><e79>: Abbrev Number: 2 (DW_TAG_member)
    <e7a>   DW_AT_name        : (indirect string, offset: 0xcaa6f): Init
    <e7e>   DW_AT_decl_file   : 10
    <e7f>   DW_AT_decl_line   : 113
    <e80>   DW_AT_decl_column : 25
    <e81>   DW_AT_type        : <0xe21>
    <e85>   DW_AT_data_member_location: 4
 <2><e86>: Abbrev Number: 2 (DW_TAG_member)
    <e87>   DW_AT_name        : (indirect string, offset: 0x73a1b): Lock
    <e8b>   DW_AT_decl_file   : 10
    <e8c>   DW_AT_decl_line   : 115
    <e8d>   DW_AT_decl_column : 25
    <e8e>   DW_AT_type        : <0xb44>
    <e92>   DW_AT_data_member_location: 32
 <2><e93>: Abbrev Number: 2 (DW_TAG_member)
    <e94>   DW_AT_name        : (indirect string, offset: 0xcc1cf): State
    <e98>   DW_AT_decl_file   : 10
    <e99>   DW_AT_decl_line   : 117
    <e9a>   DW_AT_decl_column : 25
    <e9b>   DW_AT_type        : <0xe54>
    <e9f>   DW_AT_data_member_location: 33
 <2><ea0>: Abbrev Number: 2 (DW_TAG_member)
    <ea1>   DW_AT_name        : (indirect string, offset: 0xc995e): Parent
    <ea5>   DW_AT_decl_file   : 10
    <ea6>   DW_AT_decl_line   : 119
    <ea7>   DW_AT_decl_column : 26
    <ea8>   DW_AT_type        : <0xf0e>
    <eac>   DW_AT_data_member_location: 36
 <2><ead>: Abbrev Number: 2 (DW_TAG_member)
    <eae>   DW_AT_name        : (indirect string, offset: 0xc99bd): XferCpltCallback
    <eb2>   DW_AT_decl_file   : 10
    <eb3>   DW_AT_decl_line   : 121
    <eb4>   DW_AT_decl_column : 28
    <eb5>   DW_AT_type        : <0xf20>
    <eb9>   DW_AT_data_member_location: 40
 <2><eba>: Abbrev Number: 2 (DW_TAG_member)
    <ebb>   DW_AT_name        : (indirect string, offset: 0xc9708): XferHalfCpltCallback
    <ebf>   DW_AT_decl_file   : 10
    <ec0>   DW_AT_decl_line   : 123
    <ec1>   DW_AT_decl_column : 28
    <ec2>   DW_AT_type        : <0xf20>
    <ec6>   DW_AT_data_member_location: 44
 <2><ec7>: Abbrev Number: 2 (DW_TAG_member)
    <ec8>   DW_AT_name        : (indirect string, offset: 0xc8fe1): XferErrorCallback
    <ecc>   DW_AT_decl_file   : 10
    <ecd>   DW_AT_decl_line   : 125
    <ece>   DW_AT_decl_column : 28
    <ecf>   DW_AT_type        : <0xf20>
    <ed3>   DW_AT_data_member_location: 48
 <2><ed4>: Abbrev Number: 2 (DW_TAG_member)
    <ed5>   DW_AT_name        : (indirect string, offset: 0xc93b3): XferAbortCallback
    <ed9>   DW_AT_decl_file   : 10
    <eda>   DW_AT_decl_line   : 127
    <edb>   DW_AT_decl_column : 28
    <edc>   DW_AT_type        : <0xf20>
    <ee0>   DW_AT_data_member_location: 52
 <2><ee1>: Abbrev Number: 2 (DW_TAG_member)
    <ee2>   DW_AT_name        : (indirect string, offset: 0xc999d): ErrorCode
    <ee6>   DW_AT_decl_file   : 10
    <ee7>   DW_AT_decl_line   : 129
    <ee8>   DW_AT_decl_column : 25
    <ee9>   DW_AT_type        : <0x621>
    <eed>   DW_AT_data_member_location: 56
 <2><eee>: Abbrev Number: 2 (DW_TAG_member)
    <eef>   DW_AT_name        : (indirect string, offset: 0xc927e): DmaBaseAddress
    <ef3>   DW_AT_decl_file   : 10
    <ef4>   DW_AT_decl_line   : 131
    <ef5>   DW_AT_decl_column : 25
    <ef6>   DW_AT_type        : <0xf25>
    <efa>   DW_AT_data_member_location: 60
 <2><efb>: Abbrev Number: 2 (DW_TAG_member)
    <efc>   DW_AT_name        : (indirect string, offset: 0xc9026): ChannelIndex
    <f00>   DW_AT_decl_file   : 10
    <f01>   DW_AT_decl_line   : 133
    <f02>   DW_AT_decl_column : 25
    <f03>   DW_AT_type        : <0x615>
    <f07>   DW_AT_data_member_location: 64
 <2><f08>: Abbrev Number: 0
 <1><f09>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f0a>   DW_AT_byte_size   : 4
    <f0a>   DW_AT_type        : <0x87d>
 <1><f0e>: Abbrev Number: 37 (DW_TAG_pointer_type)
    <f0f>   DW_AT_byte_size   : 4
 <1><f10>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <f11>   DW_AT_prototyped  : 1
    <f11>   DW_AT_sibling     : <0xf1b>
 <2><f15>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <f16>   DW_AT_type        : <0xf1b>
 <2><f1a>: Abbrev Number: 0
 <1><f1b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f1c>   DW_AT_byte_size   : 4
    <f1c>   DW_AT_type        : <0xe60>
 <1><f20>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f21>   DW_AT_byte_size   : 4
    <f21>   DW_AT_type        : <0xf10>
 <1><f25>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f26>   DW_AT_byte_size   : 4
    <f26>   DW_AT_type        : <0x8b0>
 <1><f2a>: Abbrev Number: 5 (DW_TAG_typedef)
    <f2b>   DW_AT_name        : (indirect string, offset: 0xc9852): DMA_HandleTypeDef
    <f2f>   DW_AT_decl_file   : 10
    <f30>   DW_AT_decl_line   : 134
    <f31>   DW_AT_decl_column : 3
    <f32>   DW_AT_type        : <0xe60>
 <1><f36>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f37>   DW_AT_byte_size   : 4
    <f37>   DW_AT_type        : <0x5ee>
 <1><f3b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f3c>   DW_AT_byte_size   : 4
    <f3c>   DW_AT_type        : <0xf2a>
 <1><f40>: Abbrev Number: 17 (DW_TAG_structure_type)
    <f41>   DW_AT_byte_size   : 24
    <f42>   DW_AT_decl_file   : 11
    <f43>   DW_AT_decl_line   : 46
    <f44>   DW_AT_decl_column : 9
    <f44>   DW_AT_sibling     : <0xf97>
 <2><f48>: Abbrev Number: 2 (DW_TAG_member)
    <f49>   DW_AT_name        : (indirect string, offset: 0xc9e52): Prescaler
    <f4d>   DW_AT_decl_file   : 11
    <f4e>   DW_AT_decl_line   : 48
    <f4f>   DW_AT_decl_column : 12
    <f50>   DW_AT_type        : <0x615>
    <f54>   DW_AT_data_member_location: 0
 <2><f55>: Abbrev Number: 2 (DW_TAG_member)
    <f56>   DW_AT_name        : (indirect string, offset: 0xc98dd): CounterMode
    <f5a>   DW_AT_decl_file   : 11
    <f5b>   DW_AT_decl_line   : 51
    <f5c>   DW_AT_decl_column : 12
    <f5d>   DW_AT_type        : <0x615>
    <f61>   DW_AT_data_member_location: 4
 <2><f62>: Abbrev Number: 2 (DW_TAG_member)
    <f63>   DW_AT_name        : (indirect string, offset: 0xd2ff4): Period
    <f67>   DW_AT_decl_file   : 11
    <f68>   DW_AT_decl_line   : 54
    <f69>   DW_AT_decl_column : 12
    <f6a>   DW_AT_type        : <0x615>
    <f6e>   DW_AT_data_member_location: 8
 <2><f6f>: Abbrev Number: 2 (DW_TAG_member)
    <f70>   DW_AT_name        : (indirect string, offset: 0xc921d): ClockDivision
    <f74>   DW_AT_decl_file   : 11
    <f75>   DW_AT_decl_line   : 58
    <f76>   DW_AT_decl_column : 12
    <f77>   DW_AT_type        : <0x615>
    <f7b>   DW_AT_data_member_location: 12
 <2><f7c>: Abbrev Number: 2 (DW_TAG_member)
    <f7d>   DW_AT_name        : (indirect string, offset: 0xc9621): RepetitionCounter
    <f81>   DW_AT_decl_file   : 11
    <f82>   DW_AT_decl_line   : 61
    <f83>   DW_AT_decl_column : 12
    <f84>   DW_AT_type        : <0x615>
    <f88>   DW_AT_data_member_location: 16
 <2><f89>: Abbrev Number: 2 (DW_TAG_member)
    <f8a>   DW_AT_name        : (indirect string, offset: 0xc8f78): AutoReloadPreload
    <f8e>   DW_AT_decl_file   : 11
    <f8f>   DW_AT_decl_line   : 72
    <f90>   DW_AT_decl_column : 12
    <f91>   DW_AT_type        : <0x615>
    <f95>   DW_AT_data_member_location: 20
 <2><f96>: Abbrev Number: 0
 <1><f97>: Abbrev Number: 5 (DW_TAG_typedef)
    <f98>   DW_AT_name        : (indirect string, offset: 0xc9177): TIM_Base_InitTypeDef
    <f9c>   DW_AT_decl_file   : 11
    <f9d>   DW_AT_decl_line   : 74
    <f9e>   DW_AT_decl_column : 3
    <f9f>   DW_AT_type        : <0xf40>
 <1><fa3>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <fa4>   DW_AT_encoding    : 7	(unsigned)
    <fa4>   DW_AT_byte_size   : 1
    <fa4>   DW_AT_type        : <0x597>
    <fa8>   DW_AT_decl_file   : 11
    <fa8>   DW_AT_decl_line   : 305
    <faa>   DW_AT_decl_column : 1
    <faa>   DW_AT_sibling     : <0xfcd>
 <2><fae>: Abbrev Number: 3 (DW_TAG_enumerator)
    <faf>   DW_AT_name        : (indirect string, offset: 0xc9338): HAL_TIM_STATE_RESET
    <fb3>   DW_AT_const_value : 0
 <2><fb4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <fb5>   DW_AT_name        : (indirect string, offset: 0xc8ecc): HAL_TIM_STATE_READY
    <fb9>   DW_AT_const_value : 1
 <2><fba>: Abbrev Number: 3 (DW_TAG_enumerator)
    <fbb>   DW_AT_name        : (indirect string, offset: 0xc9083): HAL_TIM_STATE_BUSY
    <fbf>   DW_AT_const_value : 2
 <2><fc0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <fc1>   DW_AT_name        : (indirect string, offset: 0xc97c5): HAL_TIM_STATE_TIMEOUT
    <fc5>   DW_AT_const_value : 3
 <2><fc6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <fc7>   DW_AT_name        : (indirect string, offset: 0xc9530): HAL_TIM_STATE_ERROR
    <fcb>   DW_AT_const_value : 4
 <2><fcc>: Abbrev Number: 0
 <1><fcd>: Abbrev Number: 8 (DW_TAG_typedef)
    <fce>   DW_AT_name        : (indirect string, offset: 0xc9633): HAL_TIM_StateTypeDef
    <fd2>   DW_AT_decl_file   : 11
    <fd3>   DW_AT_decl_line   : 311
    <fd5>   DW_AT_decl_column : 3
    <fd6>   DW_AT_type        : <0xfa3>
 <1><fda>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <fdb>   DW_AT_type        : <0xfcd>
 <1><fdf>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <fe0>   DW_AT_encoding    : 7	(unsigned)
    <fe0>   DW_AT_byte_size   : 1
    <fe0>   DW_AT_type        : <0x597>
    <fe4>   DW_AT_decl_file   : 11
    <fe4>   DW_AT_decl_line   : 317
    <fe6>   DW_AT_decl_column : 1
    <fe6>   DW_AT_sibling     : <0xffd>
 <2><fea>: Abbrev Number: 3 (DW_TAG_enumerator)
    <feb>   DW_AT_name        : (indirect string, offset: 0xc8f25): HAL_TIM_CHANNEL_STATE_RESET
    <fef>   DW_AT_const_value : 0
 <2><ff0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ff1>   DW_AT_name        : (indirect string, offset: 0xc96c4): HAL_TIM_CHANNEL_STATE_READY
    <ff5>   DW_AT_const_value : 1
 <2><ff6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ff7>   DW_AT_name        : (indirect string, offset: 0xc92ec): HAL_TIM_CHANNEL_STATE_BUSY
    <ffb>   DW_AT_const_value : 2
 <2><ffc>: Abbrev Number: 0
 <1><ffd>: Abbrev Number: 8 (DW_TAG_typedef)
    <ffe>   DW_AT_name        : (indirect string, offset: 0xc9033): HAL_TIM_ChannelStateTypeDef
    <1002>   DW_AT_decl_file   : 11
    <1003>   DW_AT_decl_line   : 321
    <1005>   DW_AT_decl_column : 3
    <1006>   DW_AT_type        : <0xfdf>
 <1><100a>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <100b>   DW_AT_type        : <0xffd>
 <1><100f>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <1010>   DW_AT_encoding    : 7	(unsigned)
    <1010>   DW_AT_byte_size   : 1
    <1010>   DW_AT_type        : <0x597>
    <1014>   DW_AT_decl_file   : 11
    <1014>   DW_AT_decl_line   : 327
    <1016>   DW_AT_decl_column : 1
    <1016>   DW_AT_sibling     : <0x102d>
 <2><101a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <101b>   DW_AT_name        : (indirect string, offset: 0xc8ea7): HAL_DMA_BURST_STATE_RESET
    <101f>   DW_AT_const_value : 0
 <2><1020>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1021>   DW_AT_name        : (indirect string, offset: 0xc93d1): HAL_DMA_BURST_STATE_READY
    <1025>   DW_AT_const_value : 1
 <2><1026>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1027>   DW_AT_name        : (indirect string, offset: 0xc96ab): HAL_DMA_BURST_STATE_BUSY
    <102b>   DW_AT_const_value : 2
 <2><102c>: Abbrev Number: 0
 <1><102d>: Abbrev Number: 8 (DW_TAG_typedef)
    <102e>   DW_AT_name        : (indirect string, offset: 0xc8fc4): HAL_TIM_DMABurstStateTypeDef
    <1032>   DW_AT_decl_file   : 11
    <1033>   DW_AT_decl_line   : 331
    <1035>   DW_AT_decl_column : 3
    <1036>   DW_AT_type        : <0x100f>
 <1><103a>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <103b>   DW_AT_type        : <0x102d>
 <1><103f>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <1040>   DW_AT_encoding    : 7	(unsigned)
    <1040>   DW_AT_byte_size   : 1
    <1040>   DW_AT_type        : <0x597>
    <1044>   DW_AT_decl_file   : 11
    <1044>   DW_AT_decl_line   : 337
    <1046>   DW_AT_decl_column : 1
    <1046>   DW_AT_sibling     : <0x1075>
 <2><104a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <104b>   DW_AT_name        : (indirect string, offset: 0xc93fe): HAL_TIM_ACTIVE_CHANNEL_1
    <104f>   DW_AT_const_value : 1
 <2><1050>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1051>   DW_AT_name        : (indirect string, offset: 0xc9417): HAL_TIM_ACTIVE_CHANNEL_2
    <1055>   DW_AT_const_value : 2
 <2><1056>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1057>   DW_AT_name        : (indirect string, offset: 0xc9430): HAL_TIM_ACTIVE_CHANNEL_3
    <105b>   DW_AT_const_value : 4
 <2><105c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <105d>   DW_AT_name        : (indirect string, offset: 0xc9449): HAL_TIM_ACTIVE_CHANNEL_4
    <1061>   DW_AT_const_value : 8
 <2><1062>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1063>   DW_AT_name        : (indirect string, offset: 0xc8f41): HAL_TIM_ACTIVE_CHANNEL_5
    <1067>   DW_AT_const_value : 16
 <2><1068>: Abbrev Number: 3 (DW_TAG_enumerator)
    <1069>   DW_AT_name        : (indirect string, offset: 0xc9462): HAL_TIM_ACTIVE_CHANNEL_6
    <106d>   DW_AT_const_value : 32
 <2><106e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <106f>   DW_AT_name        : (indirect string, offset: 0xc9242): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <1073>   DW_AT_const_value : 0
 <2><1074>: Abbrev Number: 0
 <1><1075>: Abbrev Number: 8 (DW_TAG_typedef)
    <1076>   DW_AT_name        : (indirect string, offset: 0xc934c): HAL_TIM_ActiveChannel
    <107a>   DW_AT_decl_file   : 11
    <107b>   DW_AT_decl_line   : 349
    <107d>   DW_AT_decl_column : 3
    <107e>   DW_AT_type        : <0x103f>
 <1><1082>: Abbrev Number: 14 (DW_TAG_structure_type)
    <1083>   DW_AT_byte_size   : 76
    <1084>   DW_AT_decl_file   : 11
    <1085>   DW_AT_decl_line   : 357
    <1087>   DW_AT_decl_column : 9
    <1087>   DW_AT_sibling     : <0x110a>
 <2><108b>: Abbrev Number: 1 (DW_TAG_member)
    <108c>   DW_AT_name        : (indirect string, offset: 0xc91ef): Instance
    <1090>   DW_AT_decl_file   : 11
    <1091>   DW_AT_decl_line   : 360
    <1093>   DW_AT_decl_column : 39
    <1094>   DW_AT_type        : <0x110a>
    <1098>   DW_AT_data_member_location: 0
 <2><1099>: Abbrev Number: 1 (DW_TAG_member)
    <109a>   DW_AT_name        : (indirect string, offset: 0xcaa6f): Init
    <109e>   DW_AT_decl_file   : 11
    <109f>   DW_AT_decl_line   : 361
    <10a1>   DW_AT_decl_column : 38
    <10a2>   DW_AT_type        : <0xf97>
    <10a6>   DW_AT_data_member_location: 4
 <2><10a7>: Abbrev Number: 1 (DW_TAG_member)
    <10a8>   DW_AT_name        : (indirect string, offset: 0xc935a): Channel
    <10ac>   DW_AT_decl_file   : 11
    <10ad>   DW_AT_decl_line   : 362
    <10af>   DW_AT_decl_column : 38
    <10b0>   DW_AT_type        : <0x1075>
    <10b4>   DW_AT_data_member_location: 28
 <2><10b5>: Abbrev Number: 1 (DW_TAG_member)
    <10b6>   DW_AT_name        : (indirect string, offset: 0xc94dc): hdma
    <10ba>   DW_AT_decl_file   : 11
    <10bb>   DW_AT_decl_line   : 363
    <10bd>   DW_AT_decl_column : 39
    <10be>   DW_AT_type        : <0x110f>
    <10c2>   DW_AT_data_member_location: 32
 <2><10c3>: Abbrev Number: 1 (DW_TAG_member)
    <10c4>   DW_AT_name        : (indirect string, offset: 0x73a1b): Lock
    <10c8>   DW_AT_decl_file   : 11
    <10c9>   DW_AT_decl_line   : 365
    <10cb>   DW_AT_decl_column : 38
    <10cc>   DW_AT_type        : <0xb44>
    <10d0>   DW_AT_data_member_location: 60
 <2><10d1>: Abbrev Number: 1 (DW_TAG_member)
    <10d2>   DW_AT_name        : (indirect string, offset: 0xcc1cf): State
    <10d6>   DW_AT_decl_file   : 11
    <10d7>   DW_AT_decl_line   : 366
    <10d9>   DW_AT_decl_column : 38
    <10da>   DW_AT_type        : <0xfda>
    <10de>   DW_AT_data_member_location: 61
 <2><10df>: Abbrev Number: 1 (DW_TAG_member)
    <10e0>   DW_AT_name        : (indirect string, offset: 0xcbc79): ChannelState
    <10e4>   DW_AT_decl_file   : 11
    <10e5>   DW_AT_decl_line   : 367
    <10e7>   DW_AT_decl_column : 38
    <10e8>   DW_AT_type        : <0x112f>
    <10ec>   DW_AT_data_member_location: 62
 <2><10ed>: Abbrev Number: 1 (DW_TAG_member)
    <10ee>   DW_AT_name        : (indirect string, offset: 0xcc2cb): ChannelNState
    <10f2>   DW_AT_decl_file   : 11
    <10f3>   DW_AT_decl_line   : 368
    <10f5>   DW_AT_decl_column : 38
    <10f6>   DW_AT_type        : <0x1144>
    <10fa>   DW_AT_data_member_location: 68
 <2><10fb>: Abbrev Number: 1 (DW_TAG_member)
    <10fc>   DW_AT_name        : (indirect string, offset: 0xcb7ef): DMABurstState
    <1100>   DW_AT_decl_file   : 11
    <1101>   DW_AT_decl_line   : 369
    <1103>   DW_AT_decl_column : 38
    <1104>   DW_AT_type        : <0x103a>
    <1108>   DW_AT_data_member_location: 72
 <2><1109>: Abbrev Number: 0
 <1><110a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <110b>   DW_AT_byte_size   : 4
    <110b>   DW_AT_type        : <0xa15>
 <1><110f>: Abbrev Number: 12 (DW_TAG_array_type)
    <1110>   DW_AT_type        : <0xf3b>
    <1114>   DW_AT_sibling     : <0x111f>
 <2><1118>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <1119>   DW_AT_type        : <0x5e7>
    <111d>   DW_AT_upper_bound : 6
 <2><111e>: Abbrev Number: 0
 <1><111f>: Abbrev Number: 12 (DW_TAG_array_type)
    <1120>   DW_AT_type        : <0x100a>
    <1124>   DW_AT_sibling     : <0x112f>
 <2><1128>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <1129>   DW_AT_type        : <0x5e7>
    <112d>   DW_AT_upper_bound : 5
 <2><112e>: Abbrev Number: 0
 <1><112f>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <1130>   DW_AT_type        : <0x111f>
 <1><1134>: Abbrev Number: 12 (DW_TAG_array_type)
    <1135>   DW_AT_type        : <0x100a>
    <1139>   DW_AT_sibling     : <0x1144>
 <2><113d>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <113e>   DW_AT_type        : <0x5e7>
    <1142>   DW_AT_upper_bound : 3
 <2><1143>: Abbrev Number: 0
 <1><1144>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <1145>   DW_AT_type        : <0x1134>
 <1><1149>: Abbrev Number: 8 (DW_TAG_typedef)
    <114a>   DW_AT_name        : (indirect string, offset: 0xc9165): TIM_HandleTypeDef
    <114e>   DW_AT_decl_file   : 11
    <114f>   DW_AT_decl_line   : 403
    <1151>   DW_AT_decl_column : 3
    <1152>   DW_AT_type        : <0x1082>
 <1><1156>: Abbrev Number: 17 (DW_TAG_structure_type)
    <1157>   DW_AT_byte_size   : 32
    <1158>   DW_AT_decl_file   : 12
    <1159>   DW_AT_decl_line   : 46
    <115a>   DW_AT_decl_column : 9
    <115a>   DW_AT_sibling     : <0x11c7>
 <2><115e>: Abbrev Number: 2 (DW_TAG_member)
    <115f>   DW_AT_name        : (indirect string, offset: 0xc98e9): BaudRate
    <1163>   DW_AT_decl_file   : 12
    <1164>   DW_AT_decl_line   : 48
    <1165>   DW_AT_decl_column : 12
    <1166>   DW_AT_type        : <0x615>
    <116a>   DW_AT_data_member_location: 0
 <2><116b>: Abbrev Number: 2 (DW_TAG_member)
    <116c>   DW_AT_name        : (indirect string, offset: 0xc8ec1): WordLength
    <1170>   DW_AT_decl_file   : 12
    <1171>   DW_AT_decl_line   : 60
    <1172>   DW_AT_decl_column : 12
    <1173>   DW_AT_type        : <0x615>
    <1177>   DW_AT_data_member_location: 4
 <2><1178>: Abbrev Number: 2 (DW_TAG_member)
    <1179>   DW_AT_name        : (indirect string, offset: 0xc98f2): StopBits
    <117d>   DW_AT_decl_file   : 12
    <117e>   DW_AT_decl_line   : 63
    <117f>   DW_AT_decl_column : 12
    <1180>   DW_AT_type        : <0x615>
    <1184>   DW_AT_data_member_location: 8
 <2><1185>: Abbrev Number: 2 (DW_TAG_member)
    <1186>   DW_AT_name        : (indirect string, offset: 0xc919f): Parity
    <118a>   DW_AT_decl_file   : 12
    <118b>   DW_AT_decl_line   : 66
    <118c>   DW_AT_decl_column : 12
    <118d>   DW_AT_type        : <0x615>
    <1191>   DW_AT_data_member_location: 12
 <2><1192>: Abbrev Number: 2 (DW_TAG_member)
    <1193>   DW_AT_name        : (indirect string, offset: 0xcb5b4): Mode
    <1197>   DW_AT_decl_file   : 12
    <1198>   DW_AT_decl_line   : 73
    <1199>   DW_AT_decl_column : 12
    <119a>   DW_AT_type        : <0x615>
    <119e>   DW_AT_data_member_location: 16
 <2><119f>: Abbrev Number: 2 (DW_TAG_member)
    <11a0>   DW_AT_name        : (indirect string, offset: 0xc94b3): HwFlowCtl
    <11a4>   DW_AT_decl_file   : 12
    <11a5>   DW_AT_decl_line   : 76
    <11a6>   DW_AT_decl_column : 12
    <11a7>   DW_AT_type        : <0x615>
    <11ab>   DW_AT_data_member_location: 20
 <2><11ac>: Abbrev Number: 2 (DW_TAG_member)
    <11ad>   DW_AT_name        : (indirect string, offset: 0xc97f9): OverSampling
    <11b1>   DW_AT_decl_file   : 12
    <11b2>   DW_AT_decl_line   : 80
    <11b3>   DW_AT_decl_column : 12
    <11b4>   DW_AT_type        : <0x615>
    <11b8>   DW_AT_data_member_location: 24
 <2><11b9>: Abbrev Number: 2 (DW_TAG_member)
    <11ba>   DW_AT_name        : (indirect string, offset: 0xc9017): OneBitSampling
    <11be>   DW_AT_decl_file   : 12
    <11bf>   DW_AT_decl_line   : 84
    <11c0>   DW_AT_decl_column : 12
    <11c1>   DW_AT_type        : <0x615>
    <11c5>   DW_AT_data_member_location: 28
 <2><11c6>: Abbrev Number: 0
 <1><11c7>: Abbrev Number: 5 (DW_TAG_typedef)
    <11c8>   DW_AT_name        : (indirect string, offset: 0xc90d2): UART_InitTypeDef
    <11cc>   DW_AT_decl_file   : 12
    <11cd>   DW_AT_decl_line   : 89
    <11ce>   DW_AT_decl_column : 3
    <11cf>   DW_AT_type        : <0x1156>
 <1><11d3>: Abbrev Number: 17 (DW_TAG_structure_type)
    <11d4>   DW_AT_byte_size   : 40
    <11d5>   DW_AT_decl_file   : 12
    <11d6>   DW_AT_decl_line   : 94
    <11d7>   DW_AT_decl_column : 9
    <11d7>   DW_AT_sibling     : <0x125e>
 <2><11db>: Abbrev Number: 2 (DW_TAG_member)
    <11dc>   DW_AT_name        : (indirect string, offset: 0xc9521): AdvFeatureInit
    <11e0>   DW_AT_decl_file   : 12
    <11e1>   DW_AT_decl_line   : 96
    <11e2>   DW_AT_decl_column : 12
    <11e3>   DW_AT_type        : <0x615>
    <11e7>   DW_AT_data_member_location: 0
 <2><11e8>: Abbrev Number: 2 (DW_TAG_member)
    <11e9>   DW_AT_name        : (indirect string, offset: 0xc9906): TxPinLevelInvert
    <11ed>   DW_AT_decl_file   : 12
    <11ee>   DW_AT_decl_line   : 101
    <11ef>   DW_AT_decl_column : 12
    <11f0>   DW_AT_type        : <0x615>
    <11f4>   DW_AT_data_member_location: 4
 <2><11f5>: Abbrev Number: 2 (DW_TAG_member)
    <11f6>   DW_AT_name        : (indirect string, offset: 0xc9806): RxPinLevelInvert
    <11fa>   DW_AT_decl_file   : 12
    <11fb>   DW_AT_decl_line   : 104
    <11fc>   DW_AT_decl_column : 12
    <11fd>   DW_AT_type        : <0x615>
    <1201>   DW_AT_data_member_location: 8
 <2><1202>: Abbrev Number: 2 (DW_TAG_member)
    <1203>   DW_AT_name        : (indirect string, offset: 0xc95c6): DataInvert
    <1207>   DW_AT_decl_file   : 12
    <1208>   DW_AT_decl_line   : 107
    <1209>   DW_AT_decl_column : 12
    <120a>   DW_AT_type        : <0x615>
    <120e>   DW_AT_data_member_location: 12
 <2><120f>: Abbrev Number: 2 (DW_TAG_member)
